{
  "name": "A structured representation of individuals' life histories, detailing personal information, educational and career trajectories, significant life events, relationships, and affiliations, each contextualized with temporal and spatial attributes to provide a comprehensive overview of a person's life journey.",
  "classes": [
    {
      "name": "Person",
      "description": "An individual human being, the main subject whose life events, relationships, and geographic movements are being described.",
      "usage_guideline": {
        "description": "Use this class to represent any individual human whose biographical data is being modeled.",
        "constraints": "Should not be used for non-human entities."
      }
    },
    {
      "name": "LifeEvent",
      "description": "An occurrence or incident that represents a meaningful change or moment in a person's life, such as marriage, migration, birth, or retirement.",
      "usage_guideline": {
        "description": "Use this class to represent significant events affecting a person's biography.",
        "constraints": "Should only model distinct and significant episodes, not daily or minor incidents."
      }
    },
    {
      "name": "Location",
      "description": "A geospatial place relevant to a person's life events, including cities, addresses, countries, or institutions like workplaces and schools.",
      "usage_guideline": {
        "description": "Use to represent any concrete locality involved in life events or personal trajectories.",
        "constraints": "Should reference recognizable geographical or institutional entities."
      }
    },
    {
      "name": "FamilyRelationship",
      "description": "A familial bond or connection between two people, capturing relationships such as parent, child, sibling, spouse, or extended family type.",
      "usage_guideline": {
        "description": "Use to classify and describe the type of relationship connecting two individuals who are part of the same family network.",
        "constraints": "Each instance should represent exactly one family relationship between two people."
      }
    },
    {
      "name": "Timeline",
      "description": "A chronological sequence of life events and statuses for a given person, which can be visualized and analyzed over time.",
      "usage_guideline": {
        "description": "Use this class to represent structured representations of a person's life as an ordered set of events, with linked ages and locations.",
        "constraints": "Should be associated with one person and may aggregate multiple events and periods."
      }
    },
    {
      "name": "Marriage",
      "description": "A life event in which two individuals form a legally or socially recognized partnership.",
      "usage_guideline": {
        "description": "Use this class to represent instances of marriage involving a person.",
        "constraints": "Should be used for legally, culturally, or socially recognized unions."
      }
    },
    {
      "name": "Divorce",
      "description": "A life event involving the legal dissolution of a marriage or partnership.",
      "usage_guideline": {
        "description": "Use this class for the formal termination of a marital relationship.",
        "constraints": "Should only represent actual, completed divorces or dissolutions."
      }
    },
    {
      "name": "Childbirth",
      "description": "A life event marking the birth of a child to a parent.",
      "usage_guideline": {
        "description": "Use to represent the event of a child being born, linked to the parent(s) and child.",
        "constraints": "Should only be used for birth events."
      }
    },
    {
      "name": "Adoption",
      "description": "A life event in which a person legally becomes the parent of a child who is not their biological offspring.",
      "usage_guideline": {
        "description": "Use for events where the legal parent-child relationship is established by adoption.",
        "constraints": "Applicable where legal or formal adoption processes have occurred."
      }
    },
    {
      "name": "HealthCrisis",
      "description": "A significant adverse health event or period in a person's life, such as illness, injury, or medical emergency.",
      "usage_guideline": {
        "description": "Apply to model major health-related incidents impacting a person.",
        "constraints": "Should be used for critical, notable health events only."
      }
    },
    {
      "name": "Migration",
      "description": "A life event where a person changes their residence across a significant geographic boundary, such as moving city, region, or country.",
      "usage_guideline": {
        "description": "Use to represent moves involving meaningful geographic relocation.",
        "constraints": "Should be applied to moves of lasting significance or distance."
      }
    },
    {
      "name": "Retirement",
      "description": "A life event in which a person ceases regular paid employment or professional activity, typically marking the end of a career.",
      "usage_guideline": {
        "description": "Use to indicate formal withdrawal from active employment.",
        "constraints": "Should only be used for events marking the intent to retire or formal retirement from work."
      }
    },
    {
      "name": "UncertainEvent",
      "description": "A life event or episode in a person’s timeline whose occurrence, timing, participants, or other relevant details are not known with certainty.",
      "usage_guideline": {
        "description": "Use for modeling events where the information is incomplete, ambiguous, disrupted, or otherwise uncertain.",
        "constraints": "Should only be used when a LifeEvent’s existence or properties (timing, participants, location, etc.) are indeterminate or contested."
      }
    },
    {
      "name": "Organization",
      "description": "A social institution, employer, academic entity, or other organized group to which a person may belong, be affiliated, or interact.",
      "usage_guideline": {
        "description": "Use to represent schools, employers, clubs, societies, or community groups relevant to a person’s affiliations.",
        "constraints": "Should not be used for informal or ad hoc groupings unless they have some continuity or formal identity."
      }
    },
    {
      "name": "CommunityGroup",
      "description": "An informal or semi-formal group, club, union, or association with social, hobbyist, community, activist, or other shared purposes to which a person may be affiliated. Unlike organizations, community groups may lack formal institutional structure.",
      "usage_guideline": {
        "description": "Use this class to represent clubs, unions, informal groups, or associations that operate below the level of formal organizations but exhibit some communal identity or continuity.",
        "constraints": "Should not be used for fully formalized organizations, employers, or educational institutions already covered by the Organization class. May represent ephemeral, grassroots, or loosely structured collectives."
      }
    },
    {
      "name": "AffiliationRole",
      "description": "A formal title, position, or status held by a person during the period of their affiliation with an organization, community group, or association (such as member, president, secretary, volunteer, etc.).",
      "usage_guideline": {
        "description": "Use to define the specific role or status that a person held within an affiliation context, including both formal and informal designations.",
        "constraints": "Should reflect one role per affiliation period; use terms relevant to the context (e.g., 'member' for clubs, 'employee' for companies, 'chair' for committees)."
      }
    },
    {
      "name": "Source",
      "description": "A documentary, archival, personal, or institutional source containing information about a person's life events, such as civil records, governmental registries, institutional databases, personal diaries, letters, or oral histories.",
      "usage_guideline": {
        "description": "Use to represent any object, document, testimony, or artifact that serves as evidence for biographical record-keeping or research.",
        "constraints": "Should not include classes such as Person or Organization unless those are acting as the provenance for a source."
      }
    },
    {
      "name": "SocialRelationship",
      "description": "A non-familial relationship between two or more persons, capturing social, professional, mentoring, collegial, or friendship connections.",
      "usage_guideline": {
        "description": "Use to model ties between individuals who are connected through social or professional networks outside the family (e.g., mentor, colleague, friend).",
        "constraints": "Should be distinguished from FamilyRelationship. Multiple individuals can be involved in a SocialRelationship instance."
      }
    },
    {
      "name": "SocialNetwork",
      "description": "A collection or system of interrelated persons representing a social or professional community, network, or constellation (e.g., mentorship network, friends group, professional association).",
      "usage_guideline": {
        "description": "Use to group persons in a structure that supports the description and analysis of their broader social as well as professional communities.",
        "constraints": "Should not duplicate Organization, CommunityGroup, or other group membership; designed for modeling complex relationships across groups."
      }
    },
    {
      "name": "Document",
      "description": "A written, printed, or digital record that provides information or evidence about a person’s life, such as official certificates, manuscripts, letters, diaries, or any other documentary artifact relevant to biographical records.",
      "usage_guideline": {
        "description": "Use this class to represent any physical or digital document that is referenced as evidence for biographical events or information about an individual.",
        "constraints": "Do not use for oral histories, testimonies, or records that are not in material or digital form. Use appropriate subclasses for specific document types where necessary."
      }
    },
    {
      "name": "Testimony",
      "description": "A firsthand account, statement, or oral history provided by an individual as evidence or narrative of biographical events or experiences.",
      "usage_guideline": {
        "description": "Use this class for oral histories, interviews, autobiographical accounts, or any personal narratives provided directly by individuals.",
        "constraints": "Testimony should be based on direct personal knowledge. Written testimonies may also be included if the personal account is primary."
      }
    },
    {
      "name": "Movement",
      "description": "A major social, political, or cultural collective action, ideology, period, or movement (such as suffrage, civil rights, reform, artistic, or religious movements) that impacts or involves individuals or life events.",
      "usage_guideline": {
        "description": "Use to represent notable named or studied movements that have shaped or been reflected in individual biographies.",
        "constraints": "Should only be created for historical, well-defined, or recognized movements, not for informal group actions or trends."
      }
    },
    {
      "name": "EducationInterruption",
      "description": "A life event or episode in which an individual's education is paused, delayed, suspended, or otherwise interrupted for a period due to various reasons, such as health, personal choice, or external circumstances.",
      "usage_guideline": {
        "description": "Use this class to represent instances where formal or informal education is halted temporarily or permanently before resumption or completion.",
        "constraints": "Should be used only for interruptions of significant duration or consequence, not minor or scheduled breaks."
      }
    },
    {
      "name": "CareerInterruption",
      "description": "A life event or episode where an individual's career progression is paused or discontinued for a temporary or extended period due to circumstances such as sabbaticals, parental leave, illness, or other personal reasons.",
      "usage_guideline": {
        "description": "Use this class to represent instances where paid employment or professional activity is formally or informally interrupted.",
        "constraints": "Should only include interruptions of substantial duration; do not use for routine vacations or short-term absences."
      }
    },
    {
      "name": "ResumptionEvent",
      "description": "A life event marking the resumption or continuation of an individual's education or career following a period of interruption.",
      "usage_guideline": {
        "description": "Use to represent the point at which a previously paused education or career activity is formally restarted.",
        "constraints": "Must be temporally linked to a prior interruption event."
      }
    },
    {
      "name": "JobTitle",
      "description": "A formal or informal designation reflecting the position, rank, or title held by a person within an employment or career context (e.g., Teacher, Engineer, CEO).",
      "usage_guideline": {
        "description": "Use for specific roles or titles assigned during employment periods.",
        "constraints": "Not intended for organization-wide roles; each instance should reflect a single role/designation within a given employment or career span."
      }
    },
    {
      "name": "Employer",
      "description": "An organization, company, institution, or entity for which a person works or has worked during an employment period.",
      "usage_guideline": {
        "description": "Use for organizations that serve as the direct employing body in a career trajectory.",
        "constraints": "Do not duplicate with affiliations unless the entity is acting as an employer."
      }
    },
    {
      "name": "CareerTransition",
      "description": "A significant change, shift, or movement in a person's career path, such as changing employers, shifting professional fields, or taking on substantially different roles.",
      "usage_guideline": {
        "description": "Use to explicitly model episodes where major career changes occur.",
        "constraints": "Must indicate clear and consequential change in position, organization, or professional identity."
      }
    },
    {
      "name": "UnemploymentPeriod",
      "description": "A life event representing a time interval during which a person was not engaged in paid employment or professional activity.",
      "usage_guideline": {
        "description": "Use for modeling periods between jobs or careers where the individual was not employed.",
        "constraints": "Should have clear start and (if applicable) end dates. Does not include voluntary sabbaticals or retirement unless characterized by involuntary lack of employment."
      }
    },
    {
      "name": "Recognition",
      "description": "An award, honor, commendation, or formal recognition received by an individual for achievements, contributions, or services within their career or educational history.",
      "usage_guideline": {
        "description": "Apply to model notable recognitions including awards, honors, distinctions, or certifications.",
        "constraints": "Non-trivial recognitions relevant to career/education context only."
      }
    },
    {
      "name": "CareerRole",
      "description": "A specific function, responsibility, or designation that a person holds during a particular period within their career (e.g., Manager, Researcher, Advisor), potentially distinct from formal job title.",
      "usage_guideline": {
        "description": "Use to represent roles, duties, or functions taken during employment, which may differ from official job titles.",
        "constraints": "May coexist with JobTitle; useful to capture nuanced or multifaceted work roles."
      }
    },
    {
      "name": "Consent",
      "description": "A documented permission, agreement, or grant provided by an individual or authorized entity for the sharing, annotation, or processing of life history data.",
      "usage_guideline": {
        "description": "Apply to model formal consent records, including those for data access, research participation, or annotation purposes.",
        "constraints": "Should include consent granter, recipient, scope, date, and any restrictions."
      }
    },
    {
      "name": "LifeNarrative",
      "description": "A qualitative, holistic, or interpretive account of a person's life, encompassing overarching stories, interpretations, or themes that contextualize structured life events.",
      "usage_guideline": {
        "description": "Use to represent synthesized, descriptive, or narrative forms—such as biographies, memoirs, or thematic accounts—that provide interpretative perspectives on a person's life.",
        "constraints": "Should not duplicate Testimony or Document; reserved for synthesized narratives or high-level life stories rather than individual event records."
      }
    },
    {
      "name": "QualitativeAnnotation",
      "description": "A textual or interpretive note, annotation, or contextual commentary that supplements the representation of a life event or narrative with additional meaning or explanation.",
      "usage_guideline": {
        "description": "Use for qualitative text, interpretive notes, or narrative commentary associated with LifeEvents or LifeNarratives, such as personal reflections, scholarly context, or explanatory remarks.",
        "constraints": "Annotations should be relevant, concise, and provide interpretative or contextual added value. Not to be confused with uncertainty notes."
      }
    },
    {
      "name": "DigitalArtifact",
      "description": "A digital file or object, such as a photograph, certificate, audio/video recording, or scanned document, that is associated with events or episodes in a person's life history.",
      "usage_guideline": {
        "description": "Use this class to represent digital materials, files, or records—regardless of format—that are generated, collected, or associated with a person or their life events.",
        "constraints": "Should include only digital (not physical-only) materials. May be subclassed for more specific artifact types if needed."
      }
    },
    {
      "name": "PrivacyRestriction",
      "description": "A specific constraint, mechanism, or rule that limits the visibility, sharing, or handling of personal data due to privacy, sensitivity, or risk concerns.",
      "usage_guideline": {
        "description": "Apply to track individual-level or document-level privacy restrictions, limitations, or risk-based access constraints on biographical or life history data.",
        "constraints": "Avoid using for general consent records; focus on concrete, actionable restrictions or flagged sensitivity."
      }
    },
    {
      "name": "SensitiveInformation",
      "description": "A category or flag indicating that certain data or information related to a person or life event is especially sensitive, at-risk, or subject to heightened protection.",
      "usage_guideline": {
        "description": "Use to identify and flag data that requires special confidentiality, such as at-risk personal details, information on minors, or culturally sensitive records.",
        "constraints": "Should be set only where an explicit determination of sensitivity is present."
      }
    },
    {
      "name": "AccessControlPolicy",
      "description": "A defined set of rules or configurations that determine who may access, view, edit, or share specific personal data, digital artifacts, or biographical records.",
      "usage_guideline": {
        "description": "Use to denote the policies that govern access (authorization, authentication, or prohibition) to data/artifacts at the person, event, or artifact level.",
        "constraints": "Each policy should describe concrete access rules and be linked to relevant data items."
      }
    },
    {
      "name": "Relocation",
      "description": "A life event in which an individual changes their place of residence or usual living situation, involving a move that does not necessarily cross significant geographic or political boundaries (such as moving within a city, to a new neighborhood, or a different residence).",
      "usage_guideline": {
        "description": "Use to represent residential moves that are not migrations (i.e., do not cross major political/geographic boundaries), or that are of a more local, routine, or administrative nature.",
        "constraints": "Should be used only for non-trivial relocations (more than temporary stays, visits, or holidays)."
      }
    },
    {
      "name": "Travel",
      "description": "A life event in which an individual undertakes a journey or movement for a defined purpose without establishing a new residence, such as visiting other places for work, study, leisure, or other reasons.",
      "usage_guideline": {
        "description": "Use to represent temporary movements or journeys that do not change the individual's principal residence.",
        "constraints": "Should be distinct from Migration and Relocation; include durations, purposes, and destinations if available."
      }
    },
    {
      "name": "EnvironmentalDisruption",
      "description": "An environmental event or phenomenon that causes significant disruption to individuals or communities, such as natural disasters, severe weather events, or climate-related incidents.",
      "usage_guideline": {
        "description": "Use to represent disruptive environmental events (e.g., earthquake, flood, drought) that have a concrete impact on one or more individuals' lives.",
        "constraints": "Should be used only when there is a clear link to persons or life events."
      }
    },
    {
      "name": "EconomicDisruption",
      "description": "An event or episode resulting from broad economic changes or crises, such as recessions, depressions, or major financial upheavals, which materially impact an individual's or community's life path.",
      "usage_guideline": {
        "description": "Apply to disruptions from economic phenomena (e.g., loss of employment due to recession).",
        "constraints": "Reserve for significant economic events, not ordinary financial fluctuations."
      }
    },
    {
      "name": "SocietalDisruption",
      "description": "A collective social, political, or civil event (such as war, pandemic, revolution, or mass migration) that significantly disrupts the normal course of individuals' or groups' lives.",
      "usage_guideline": {
        "description": "Use for major societal-scale disruptions affecting life histories (e.g., pandemic, war, civil unrest).",
        "constraints": "Apply only when disruption has demonstrable impact on the person or event being modeled."
      }
    },
    {
      "name": "Annotation",
      "description": "A structured note, semantic tag, or commentary added to life events, narratives, or data entries to provide enrichment, explanation, or semantic classification beyond the factual record.",
      "usage_guideline": {
        "description": "Use to represent any structured enrichment of life data, including semantic tags, thematic notes, scholarly commentary, or interpretive labeling attached to specific records or events.",
        "constraints": "Distinct from QualitativeAnnotation, which is primarily free-text; Annotation may comprise structured or controlled tags, comments, or links to vocabularies."
      }
    },
    {
      "name": "VerificationStatus",
      "description": "A categorization or assessment indicating the degree of confidence, confirmation, or validation that a life event, narrative entry, or data point is accurate and supported by evidence.",
      "usage_guideline": {
        "description": "Use to model the reliability, confirmedness, or verification level of information, such as 'verified', 'unverified', 'contested', or 'pending'.",
        "constraints": "Should use controlled vocabulary. Each instance reflects the verification assessment for a particular datum or event."
      }
    },
    {
      "name": "EducationEpisode",
      "description": "A distinct period in an individual's educational trajectory, representing formal or informal enrollment, study, or completion at a specific institution or program, potentially leading to credentials or degrees.",
      "usage_guideline": {
        "description": "Use for modeling each educational segment or period (such as enrollment at a school, university, or training program), capturing start and end dates, location, field of study, and outcome (credential).",
        "constraints": "Do not use for isolated classes or workshops; should cover structured education of significant duration."
      }
    },
    {
      "name": "Credential",
      "description": "A formally awarded certificate, degree, diploma, or other recognition granted upon completion of an educational episode or program.",
      "usage_guideline": {
        "description": "Use to model degrees, diplomas, certifications, and similar awards conferred by educational institutions.",
        "constraints": "Should be linked to the relevant EducationEpisode and Institution. Avoid using for informal recognitions or non-institutional awards."
      }
    },
    {
      "name": "Program",
      "description": "A structured curriculum or course of study offered by an educational institution, such as a degree program, training track, or certification curriculum.",
      "usage_guideline": {
        "description": "Use to represent discrete programs, tracks, or structured curricula within an institution to which an individual might be admitted or enrolled.",
        "constraints": "Programs should be institution-specific; do not use for general fields of study."
      }
    },
    {
      "name": "FieldOfStudy",
      "description": "An area, discipline, or subject in which an individual pursues systematic study during an education episode or program.",
      "usage_guideline": {
        "description": "Use to designate the academic, vocational, or thematic focus of an educational episode or program (e.g., History, Biology, Engineering).",
        "constraints": "Should follow recognized academic or training fields. Use controlled vocabularies where possible."
      }
    },
    {
      "name": "Institution",
      "description": "An educational entity such as a school, college, university, or academy that offers formal programs, awards credentials, and hosts education episodes.",
      "usage_guideline": {
        "description": "Use to represent the physical or organizational entity where education occurs, distinct from the Organization class when the context is strictly educational.",
        "constraints": "Use for modeling formal education providers only. Do not duplicate with Organization unless necessary for hierarchical structure."
      }
    },
    {
      "name": "Mentorship",
      "description": "A social relationship where one person (mentor) offers guidance, knowledge, or support to another (mentee), particularly influencing educational or career development.",
      "usage_guideline": {
        "description": "Use to represent mentorship relations, specifying participants and time period. Distinguish from general SocialRelationship by the reflective influence on career or educational trajectories.",
        "constraints": "Each Mentorship instance should have at least a mentor and a mentee; use only when there is an explicit, ongoing guidance role."
      }
    },
    {
      "name": "SocioEconomicStatusChange",
      "description": "A life episode or event marking a significant transition in an individual's socio-economic standing, due to factors such as education, employment, income shifts, or major life events.",
      "usage_guideline": {
        "description": "Use for modeling major upward/downward status changes, linking with causes where possible.",
        "constraints": "Document only validated, impactful changes. Do not use for minor fluctuations."
      }
    },
    {
      "name": "LegalEvent",
      "description": "An event involving a legally significant action or episode in a person's life, such as changes in citizenship, court cases, legal recognition of name or status, or other matters affecting legal identity or standing.",
      "usage_guideline": {
        "description": "Use to represent legally recognized events that impact an individual's official identity, status, or life trajectory.",
        "constraints": "Should only be used for events with clear legal significance, not for ordinary administrative actions."
      }
    },
    {
      "name": "NameChange",
      "description": "A legal event in which an individual formally changes their name, recognized by official authority or documentation.",
      "usage_guideline": {
        "description": "Use for legally documented or recognized changes of an individual's name.",
        "constraints": "Should not be used for informal aliases or nicknames."
      }
    },
    {
      "name": "StatusChange",
      "description": "A legal event in which an individual's legal status (such as marital status, citizenship, or residency) is altered by court decision, official process, or recognized authority.",
      "usage_guideline": {
        "description": "Use to represent events in which a legal status attribute of a person is formally altered.",
        "constraints": "Should only cover events with official, legal impact."
      }
    },
    {
      "name": "CourtCase",
      "description": "A legal event in which an individual is involved in a court proceeding, which may affect their life trajectory (e.g., civil, criminal, immigration, or family court cases).",
      "usage_guideline": {
        "description": "Use for modeling formal court proceedings in which an individual is a party (plaintiff, defendant, etc.).",
        "constraints": "Do not use for informal disputes or non-court mediation."
      }
    },
    {
      "name": "CitizenshipChange",
      "description": "A legal event marking the acquisition, loss, or change of citizenship status for an individual.",
      "usage_guideline": {
        "description": "Use for modeling grant, renunciation, revocation, or other changes in an individual's citizenship.",
        "constraints": "Should only be used for formally documented changes."
      }
    },
    {
      "name": "CareerMilestone",
      "description": "A significant achievement, position, or role within a person's career trajectory, typically marking an important transition or accomplishment including appointments, major projects, or recognitions.",
      "usage_guideline": {
        "description": "Use for significant career points such as attaining a key position, completing an important project, or receiving substantial professional recognition.",
        "constraints": "Do not use for routine career activities; milestones should mark distinct and meaningful career progress."
      }
    },
    {
      "name": "ArchivalStatus",
      "description": "A categorical value indicating the archival state or disposition of a record element, such as active, archived, or uncertain.",
      "usage_guideline": {
        "description": "Use to specify the current archival state of biographical or record elements for a person.",
        "constraints": "Recommended values include 'active', 'archived', and 'uncertain'; extend only if required by domain context."
      }
    },
    {
      "name": "RecordElement",
      "description": "A discrete component or piece of an individual's personal record, such as files, data fields, or documented entities subject to archival status and modification history.",
      "usage_guideline": {
        "description": "Use to model identifiable parts of a person's record for archival management, provenance, or status tracking.",
        "constraints": "Should be used to refer to record components whose status, modification, or access may be tracked independently."
      }
    },
    {
      "name": "MigrationPathway",
      "description": "A structured representation of the origin, destination, sequence, and associated episodes of migration, relocation, or resettlement experienced by a person.",
      "usage_guideline": {
        "description": "Use for complex or multi-stage moves involving multiple migrations, relocations, or resettlement events for a given person.",
        "constraints": "Apply only when a trajectory or series of movements (not a single migration event) is represented."
      }
    },
    {
      "name": "HouseholdComposition",
      "description": "A configuration describing the people, relationships, and structure of a person's living arrangement or household at a particular time.",
      "usage_guideline": {
        "description": "Use to model household groupings, membership, and structures at specific time points or periods in an individual's life.",
        "constraints": "Should capture household as constituted at a specific point in time, with possible links to FamilyRelationship and Person."
      }
    },
    {
      "name": "LivingArrangement",
      "description": "A description of the residential, domestic, or custodial arrangement in which a person resides at a particular time, encompassing context such as cohabitation, independence, or institutional residence.",
      "usage_guideline": {
        "description": "Use to represent how and with whom a person lives at a specific period, including institutional or communal arrangements.",
        "constraints": "Should capture non-household living contexts such as group homes, dormitories, or institutions."
      }
    },
    {
      "name": "PrivacyManagementMechanism",
      "description": "A method, process, policy, or technology employed to ensure, monitor, or enforce privacy requirements for personal or sensitive data.",
      "usage_guideline": {
        "description": "Use to document and specify concrete privacy management strategies associated with personal, sensitive, or regulated data.",
        "constraints": "May include technical, procedural, or policy approaches; link to relevant Consent and PrivacyRestriction instances as needed."
      }
    },
    {
      "name": "EthicalGuideline",
      "description": "A set of principles, codes, or rules governing the ethical management, use, and protection of personal data, especially in relation to consent and sensitive information.",
      "usage_guideline": {
        "description": "Apply to reference or model formal ethical frameworks or codes applicable to data handling.",
        "constraints": "Should represent externally recognized guidelines, standards, or regulatory codes."
      }
    },
    {
      "name": "SensitivePersonalData",
      "description": "A class representing information about an individual that is considered sensitive under legal, ethical, or institutional standards and requires special protection.",
      "usage_guideline": {
        "description": "Use to model and classify information about a person deemed sensitive (e.g., medical data, identifying details, risks to safety or privacy).",
        "constraints": "Should only be used for data meeting criteria for heightened protection due to risk or legal status."
      }
    },
    {
      "name": "QualitativeTag",
      "description": "A textual or controlled-vocabulary keyword, concept, or theme assigned to data, life events, or persons to capture qualitative, interpretive, or thematic elements. Tags may express cross-cutting themes, topics, or perspectives enriching structured biographical data.",
      "usage_guideline": {
        "description": "Use for assigning interpretive, thematic, or analytical keywords or concepts not fully captured as formal annotations or narrative accounts. Tags may be constrained to controlled vocabularies or open-ended. Distinct from structured Annotation and QualitativeAnnotation classes.",
        "constraints": "Should be meaningful within the analytic or interpretive context. May be reused across multiple data elements or persons; do not use for purely factual labeling."
      }
    },
    {
      "name": "NonFormalLearningExperience",
      "description": "A learning episode occurring outside of formal educational programs or institutions but involving organized and structured learning, such as workshops, short courses, vocational training, or adult education programs.",
      "usage_guideline": {
        "description": "Use to model episodes of organized learning distinct from accredited, credentialed, or institution-based programs. Includes structured but non-institutional learning.",
        "constraints": "Do not use for informal, unstructured learning (see InformalLearningExperience). Should capture duration, topic, and provider if available."
      }
    },
    {
      "name": "InformalLearningExperience",
      "description": "A learning episode occurring outside formal and non-formal educational settings, typically through self-study, experience, family, peer groups, or other unstructured contexts.",
      "usage_guideline": {
        "description": "Use to represent episodes where knowledge or skills are acquired through personal experiences, daily activities, or community/social participation without intentional curricular structure.",
        "constraints": "Should only be used for informal learning not captured by EducationEpisode or NonFormalLearningExperience."
      }
    },
    {
      "name": "OfficialIdentifier",
      "description": "A government-issued or authoritative identifier assigned to a person, such as a national ID number, passport number, or similar unique official reference.",
      "usage_guideline": {
        "description": "Use for formal, verifiable identifiers issued by official bodies or authorities.",
        "constraints": "Should only be assigned to persons who possess such documented identifiers; includes numbers such as national identification, passport, or similar."
      }
    },
    {
      "name": "DemographicAttribute",
      "description": "A characteristic or trait such as gender, ethnicity, nationality, or other personal demography assigned to or describing an individual.",
      "usage_guideline": {
        "description": "Use for attributes capturing demographic details of individuals relevant to identity or biography.",
        "constraints": "Only represent core demographic features as defined by domain standards."
      }
    },
    {
      "name": "MembershipStatus",
      "description": "An indicator or classification denoting a person’s current or historical status of membership within an organization, association, or community group (such as active member, former member, honorary, pending, etc.).",
      "usage_guideline": {
        "description": "Use to express the nature and state of an individual's connection to a group or association.",
        "constraints": "Controlled terms preferred; one status per membership record per time period."
      }
    },
    {
      "name": "ContextualFactor",
      "description": "A relevant circumstance, environmental condition, tradition, or regional/historical event that forms the backdrop for or influences a person’s life events or milestones.",
      "usage_guideline": {
        "description": "Use for modeling major contextual influences such as traditions, significant local/national events, or environmental factors impacting an individual.",
        "constraints": "Should be concretely referenced or evidenced within biographical context."
      }
    },
    {
      "name": "LifeMilestone",
      "description": "A significant, defined achievement or turning point in a person’s life history, such as completion of education, marriage, or career appointment.",
      "usage_guideline": {
        "description": "Use for life-shaping points distinct from ordinary life events, typically celebrated or formally recognized.",
        "constraints": "Should be reserved for major, widely recognized milestones."
      }
    },
    {
      "name": "DataAccessRecord",
      "description": "A record capturing the details of access to a person's life history data, including who accessed the data, when, for what purpose, and under what consent or restriction.",
      "usage_guideline": {
        "description": "Use this class to model individual acts or episodes of access to personal or life history data, supporting audit trails and consent verification.",
        "constraints": "Should represent discrete access events. Include information on the accessing party and related consent when possible."
      }
    },
    {
      "name": "NameHistory",
      "description": "A chronological record of the various names used by an individual over time, including formal, legal, and alternative names.",
      "usage_guideline": {
        "description": "Use to document the evolution of a person's names through events such as name changes, adoptions, or use of pseudonyms.",
        "constraints": "Each instance should describe one period or version of a name in the individual's history."
      }
    },
    {
      "name": "LegalStatusHistory",
      "description": "A record of the sequence of legal statuses held by an individual over time, such as changes in citizenship, marital status, or other official designations.",
      "usage_guideline": {
        "description": "Use for tracking the official legal status of a person at different points, reflecting changes due to events or official acts.",
        "constraints": "Record each status and associated time period; reserved for statuses with formal, legal recognition."
      }
    },
    {
      "name": "IdentifierHistory",
      "description": "A sequence of official identifiers assigned to an individual over their life, including context and periods of validity.",
      "usage_guideline": {
        "description": "Document the various official identifiers assigned to a person and the time periods in which they were active.",
        "constraints": "Include start and end dates, identifier type, and issuing authority where possible."
      }
    },
    {
      "name": "ChangeTriggerEvent",
      "description": "An event or occurrence that prompts or results in a change to an individual's name, legal status, or official identifier.",
      "usage_guideline": {
        "description": "Use to explicitly model the causative event (e.g., marriage, adoption, court order) behind a legal or personal status change.",
        "constraints": "Should be linked to both the affected history (name, status, identifier) and the causative LifeEvent or LegalEvent."
      }
    },
    {
      "name": "StatusIndicator",
      "description": "A categorical or descriptive label assigned to a data point in a person's life story, indicating its current state, disposition, or reliability such as 'active', 'archived', 'uncertain', or 'discontinued'.",
      "usage_guideline": {
        "description": "Use to represent the status or disposition of a specific biographical data point or record element in the context of a person's life story.",
        "constraints": "Controlled vocabulary should be used; distinguish from verification status and archival status as needed."
      }
    },
    {
      "name": "ConsentPermission",
      "description": "A specific permission, access instruction, or condition defined within a consent agreement, describing allowed, restricted, or conditional uses of personal life history data.",
      "usage_guideline": {
        "description": "Use to model explicit permissions, access rights, or usage conditions for life history data as defined within a consent form or agreement.",
        "constraints": "Should enumerate permissions such as access type, duration, or purpose; do not use for general statements—link to specific data uses or actors."
      }
    },
    {
      "name": "EducationalSequence",
      "description": "A structured, ordered collection of educational institutions or episodes that an individual attended, supporting their chronological sequencing and analysis.",
      "usage_guideline": {
        "description": "Use this class to represent the full ordered sequence of formal education (such as schools, colleges, universities) for a person, including institutional order and transitions.",
        "constraints": "Each EducationalSequence instance should reference all relevant EducationEpisodes or Institutions in order; designed for representing overall educational trajectory rather than a single episode."
      }
    },
    {
      "name": "IntersectionalContext",
      "description": "A social or biographical context reflecting the convergence of multiple identity categories, statuses, backgrounds, or forms of participation that influence a person's life experiences and events (e.g., intersections of migration, minority status, cultural background, or community participation).",
      "usage_guideline": {
        "description": "Use this class to represent complex contexts or circumstances resulting from overlapping social identities (e.g., culture, minority status, migration) that together shape individual experiences.",
        "constraints": "Context must involve two or more intersecting dimensions or statuses relevant to the person or event; should not be used for single-dimension context."
      }
    },
    {
      "name": "TemporalDetail",
      "description": "Information or annotation specifying the time-related particulars of a migration, relocation, or travel event, such as sequence, duration, or temporal patterning.",
      "usage_guideline": {
        "description": "Use to capture complex temporal aspects of mobility episodes, including timing of moves, durations, or chronological patterns relevant to understanding life trajectories.",
        "constraints": "Should only be instantiated for episodes/events where temporal sequence or patterns are salient and not covered by basic date/duration properties."
      }
    },
    {
      "name": "SpatialDetail",
      "description": "Information or annotation specifying the spatial, geographic, or locational particulars of a migration, relocation, or travel event, such as specific routes, regions, or mapping details.",
      "usage_guideline": {
        "description": "Use to record additional spatial dimensions of a movement event, such as detailed origins, destinations, interim stops, or mapped patterns, beyond the basic Location linkage.",
        "constraints": "Provide only when more granular spatial detail is required for analysis or visualization; should supplement, not duplicate, existing Location properties."
      }
    },
    {
      "name": "MulticulturalContext",
      "description": "A context reflecting a person's or event's involvement in or experience of multiple cultures, cultural practices, or cross-cultural environments.",
      "usage_guideline": {
        "description": "Use to document episodes or circumstances where multicultural factors, cultural blending, or cross-cultural experiences are salient for interpretation.",
        "constraints": "Reserve for cases where engagement with more than one cultural identity, value system, or group is explicit and relevant to the narrative."
      }
    },
    {
      "name": "CurationAction",
      "description": "An action or process in which a person or entity authors, curates, edits, or modifies a record, document, or entry related to an individual's life history.",
      "usage_guideline": {
        "description": "Use to explicitly represent actions where a record is created, authored, curated, or subsequently modified for provenance and auditing purposes.",
        "constraints": "Should be used for discrete, attributable actions involving biographical record creation or update. Not for generic access or viewing."
      }
    },
    {
      "name": "SelfNarrative",
      "description": "A first-person narrative or self-descriptive account provided by an individual, describing their own life events, transitions, roles, or reflections.",
      "usage_guideline": {
        "description": "Use to represent direct autobiographical accounts or self-reflections authored by the subject person, distinct from third-party testimonies or synthesized narratives.",
        "constraints": "Should only be used for accounts originated by the subject individual."
      }
    },
    {
      "name": "LifePhase",
      "description": "A distinct period or phase within an individual's life trajectory, characterized by shared features, roles, or statuses (e.g., childhood, adolescence, working adulthood, retirement).",
      "usage_guideline": {
        "description": "Use to represent intervals within a person's life that group multiple events and states according to developmental, social, or biographical criteria.",
        "constraints": "Life phases may overlap and may be defined differently according to context or culture; specify delimiting criteria or context where possible."
      }
    },
    {
      "name": "Transition",
      "description": "A major change or passage that marks the movement from one life phase, status, or arrangement to another in an individual’s biography (e.g., finishing school, becoming a parent, entering retirement).",
      "usage_guideline": {
        "description": "Use to denote changes that signal the end of one status or phase and the beginning of another, especially when the transition is significant or recognized in the biographical context.",
        "constraints": "Transitions should reflect meaningful, non-trivial changes, not routine daily activities."
      }
    },
    {
      "name": "Disruption",
      "description": "An event or episode, not otherwise covered by specific disruption subclasses, that interrupts, disturbs, or alters the expected trajectory of a person's life, potentially including unanticipated breaks, losses, or interruptions.",
      "usage_guideline": {
        "description": "Use for life-affecting disruptions that do not fit more specific categories like education/career interruption or societal/environmental/economic disruption, such as divorce, bereavement, or other ad-hoc breakpoints.",
        "constraints": "Only use for consequential disruptions; avoid overlap with precise subclasses (EnvironmentalDisruption, EconomicDisruption, SocietalDisruption, etc.)."
      }
    },
    {
      "name": "RoleInGroup",
      "description": "A specific role, position, or function held by a person within a volunteer, advocacy, or cultural group, such as 'volunteer', 'member', 'organizer', 'participant', or similar designations reflecting their responsibility or standing in the group.",
      "usage_guideline": {
        "description": "Use to specify the distinct function, status, or appointment an individual holds during participation in advocacy, volunteer, or cultural groups, especially when such groups are not formal organizations.",
        "constraints": "Should represent only one role per group participation episode; use context-specific terminology consistent with the group’s practices."
      }
    },
    {
      "name": "NarrativeTranslation",
      "description": "A version or rendering of a personal narrative, oral history, or testimony in a language other than the original; used to represent the multilingual or multicultural contextualization of a narrative.",
      "usage_guideline": {
        "description": "Use for each distinct translated or adapted version of a narrative, testimony, or oral history available in another language or cultural context.",
        "constraints": "A given narrative or testimony may have zero or more translations; each translation represents a unique language or significant cultural adaptation."
      }
    },
    {
      "name": "GroupParticipation",
      "description": "A biographical episode or event in which a person takes part in a volunteer, advocacy, cultural, or similar group that is not classified as a formal organization, including time period, group identity, and held role(s).",
      "usage_guideline": {
        "description": "Model instances of active participation in civil, cultural, advocacy, or volunteer groups, capturing relevant time periods and roles. Distinguish from employment or formal organizational affiliation.",
        "constraints": "Only use when the participation is consequential and structured enough to warrant tracking (not purely informal or one-off activities)."
      }
    },
    {
      "name": "PersonalNarrative",
      "description": "A first-person account or story, including oral histories or testimonies, about a person’s life, typically reflecting their perspective, experiences, or interpretations, with potential for translation or adaptation.",
      "usage_guideline": {
        "description": "Use to represent narrative sources, oral testimonies, or personal stories, whether written, recorded, or transcribed, particularly those available in multiple languages or frameworks.",
        "constraints": "Reserve for direct, first-person biographical narratives; distinguish from third-person narratives or synthesized life stories."
      }
    },
    {
      "name": "Implication",
      "description": "An outcome, consequence, or effect resulting from a specific legal event, life event, or participation, such as a change in status, eligibility, rights, or obligations.",
      "usage_guideline": {
        "description": "Use to specify the documented effect(s) of legal events or participation episodes (e.g., becoming a citizen, right to reside, loss or gain of certain privileges).",
        "constraints": "Link only to events for which specific, recognized implications are documented."
      }
    },
    {
      "name": "Apprenticeship",
      "description": "A structured, often long-term, informal or non-formal learning experience characterized by hands-on skill acquisition under the supervision of a skilled mentor, typically outside a formal educational program.",
      "usage_guideline": {
        "description": "Use to represent episodes where a person acquires skills or expertise through practical training and mentorship, such as craft, trade, or artistic apprenticeships.",
        "constraints": "Should be categorized under informal or non-formal learning experiences, not formal education. Distinct from self-taught or community learning."
      }
    },
    {
      "name": "SelfTaughtLearning",
      "description": "An informal learning experience in which an individual acquires knowledge or skills through independent study and practice, without structured support from institutions, mentors, or peer groups.",
      "usage_guideline": {
        "description": "Use for modeling periods or episodes of self-directed learning, autodidactic activities, and personal skill acquisition without formal or non-formal settings.",
        "constraints": "Only use when the knowledge/skill was primarily acquired independently, distinct from group/community or organizational instruction."
      }
    },
    {
      "name": "CommunityInstruction",
      "description": "An informal learning experience based on social, community-based, or group-centric instruction, typically occurring through community organizations, peer-led classes, or communal learning environments.",
      "usage_guideline": {
        "description": "Use to capture learning that takes place in communal or group settings outside formal institutions (e.g., community workshops, cooperative learning, neighborhood classes).",
        "constraints": "Should not be used for formal education or fully self-directed learning. Distinct from Apprenticeship, which emphasizes individual mentorship."
      }
    },
    {
      "name": "Attachment",
      "description": "A relationship or linkage through which a source, document, digital artifact, or annotation is explicitly associated with a person’s life history as a supporting or evidentiary material (e.g., a photograph, video, audio, or scanned document attached to the life record).",
      "usage_guideline": {
        "description": "Use this class to represent an explicit association or attachment of a multimedia artifact, source, or record to a person's life history, timeline, or event. Enables modeling of the 'attachment' or inclusion context distinct from mere referencing.",
        "constraints": "An Attachment instance must link at least one artifact (e.g., photo, audio, video, document) to the appropriate person, event, or timeline; different attachments can have differing attachment types and descriptive context."
      }
    },
    {
      "name": "Language",
      "description": "A natural language spoken, written, or understood by a person, relevant to their communication ability, cultural background, or life history.",
      "usage_guideline": {
        "description": "Use for representing distinct natural languages associated with an individual, for biography, communication, or background analysis.",
        "constraints": "Should correspond to recognized natural languages; do not use for programming or artificial languages."
      }
    },
    {
      "name": "LanguageProficiency",
      "description": "A record of a person's proficiency or competence in a given language, including level and context (e.g., native, fluent, conversational, basic).",
      "usage_guideline": {
        "description": "Use to model the different levels of language proficiency for a person in specific languages.",
        "constraints": "Each instance should be tied to one person and one language; ensure to use for emphasized or contextually relevant proficiencies."
      }
    },
    {
      "name": "SabbaticalPeriod",
      "description": "A distinct period during which a person temporarily withdraws from their regular employment or professional duties, often for study, research, personal development, or rest.",
      "usage_guideline": {
        "description": "Use to record formal or informal sabbaticals, distinguishing from involuntary unemployment or routine leave.",
        "constraints": "Should represent substantial, non-routine career breaks; not used for short leaves or vacations."
      }
    },
    {
      "name": "ReasonForInterruption",
      "description": "A classification or description explaining the cause or reason for an interruption, break, sabbatical, or unemployment period in a person's life history.",
      "usage_guideline": {
        "description": "Use for capturing the explanatory factor behind life interruptions, such as health, personal choice, education, family, or external circumstances.",
        "constraints": "Should be concise and use controlled or standard terms where possible; one per interruption episode."
      }
    },
    {
      "name": "Promotion",
      "description": "A career milestone or event in which an individual is advanced to a higher position or rank within an organization or profession, typically as a recognition of merit, experience, or achievement.",
      "usage_guideline": {
        "description": "Use to represent upward movement within a professional context, such as being promoted to a higher title, role, or responsibility.",
        "constraints": "Should only be used for formal or substantive promotions as part of career progression. Not intended for routine hierarchical adjustments without increased responsibility."
      }
    },
    {
      "name": "Demotion",
      "description": "A career milestone or event in which an individual is reassigned to a lower position, title, or level of responsibility within an organization or profession.",
      "usage_guideline": {
        "description": "Apply when documenting downward changes in occupational rank or role, such as loss of position or title.",
        "constraints": "Should only record formal or consequential demotions, not temporary assignments or informal reductions."
      }
    },
    {
      "name": "EntrepreneurialActivity",
      "description": "A career milestone or event in which a person initiates, founds, or significantly develops a business, enterprise, or self-employment venture.",
      "usage_guideline": {
        "description": "Use to capture significant entrepreneurial actions, such as founding a company, initiating a startup, or launching a major independent business.",
        "constraints": "Should only include substantial, documented ventures; do not use for minor, informal, or one-off business activities."
      }
    },
    {
      "name": "ReligiousAffiliation",
      "description": "A formal or informal association that a person has with a particular religion, denomination, or spiritual tradition during a specified period of their life.",
      "usage_guideline": {
        "description": "Use this class to represent an individual's connection to religious identity, group, or practice at particular times during their life trajectory.",
        "constraints": "Should capture the religion, denomination, or tradition, and be linked to relevant periods or contexts; do not use for general beliefs unless directly linked to affiliation."
      }
    },
    {
      "name": "LanguageUseContext",
      "description": "A situation, domain, or environment in which a person uses a particular language, such as at home, in the workplace, within a cultural group, or during specific life events.",
      "usage_guideline": {
        "description": "Model distinctive settings or contexts in which a person utilizes a language (e.g., within their family, in education, at work, during migration).",
        "constraints": "Should be used in conjunction with LanguageProficiency to clarify the role or scope of language use; multiple contexts may be present for one language."
      }
    },
    {
      "name": "CareerMilestoneType",
      "description": "A classification or category denoting the type of career milestone, such as employment, promotion, recognition, or period of unemployment, contributing to the structure of occupational history.",
      "usage_guideline": {
        "description": "Assign to CareerMilestone instances to specify their particular type (e.g., employment, promotion, unemployment, recognition).",
        "constraints": "Use controlled vocabulary to maintain consistency; not intended for routine job duties but for notable episodes only."
      }
    },
    {
      "name": "PreferredName",
      "description": "A name that an individual prefers to be known by, which may differ from their legal name or aliases. Preferred names can reflect personal choice, cultural context, or social identity.",
      "usage_guideline": {
        "description": "Use to document the name an individual chooses to use in daily life, communication, or institutional contexts when it differs from legal or birth names. Suitable for recording chosen names, including those adopted for social, cultural, or gender identity reasons.",
        "constraints": "Should not be used for legal names (see NameChange or NameHistory) or for nicknames/aliases unless explicitly designated as a preferred name by the individual."
      }
    },
    {
      "name": "Alias",
      "description": "An alternative name or pseudonym by which an individual is known, distinct from legal or preferred names. Aliases may be informal, community-specific, creative, or used in particular contexts.",
      "usage_guideline": {
        "description": "Use to record any pseudonym, informal name, or handle that an individual has used, especially in public, artistic, or digital contexts. Can include stage names, pen names, nicknames, or online identities.",
        "constraints": "Should only be used for names that are actively used or sufficiently documented; do not overlap with legal names or official preferred names."
      }
    },
    {
      "name": "Degree",
      "description": "A formal academic qualification, such as a bachelor's, master's, or doctoral degree, that is typically awarded by a recognized educational institution upon successful completion of a specified program of study.",
      "usage_guideline": {
        "description": "Use to represent officially conferred academic qualifications as part of an individual's educational history.",
        "constraints": "Should only be used for academic degrees awarded by recognized institutions; distinguish from certifications, diplomas, or licenses."
      }
    },
    {
      "name": "Certification",
      "description": "A formal credential that verifies an individual's qualification or competence in a particular field or profession, usually awarded after meeting specific criteria or passing an examination.",
      "usage_guideline": {
        "description": "Use for official attestations of skill or knowledge beyond academic degrees or diplomas, such as professional certifications (e.g., teaching certificate, IT certification).",
        "constraints": "Should only include officially recognized certifications; avoid use for informal certificates of attendance."
      }
    },
    {
      "name": "Diploma",
      "description": "A document issued by an educational institution certifying the successful completion of a particular course of study or program, typically below the level of a degree.",
      "usage_guideline": {
        "description": "Apply to represent formal completion of secondary education, vocational training, or similar programs resulting in a diploma document.",
        "constraints": "Should be awarded by recognized educational institutions; do not conflate with degrees or informal certifications."
      }
    },
    {
      "name": "License",
      "description": "A formal, legal authorization granted to an individual permitting them to engage in a regulated profession or activity, often subject to renewal or revocation.",
      "usage_guideline": {
        "description": "Use to represent licensure required for regulated careers (e.g., medical license, teaching license, driver's license).",
        "constraints": "Should reflect legally binding credentialing requirements only."
      }
    },
    {
      "name": "MultimediaArtifact",
      "description": "A tangible or digital artifact consisting of multimedia content such as a photograph, video, or audio recording, associated with a person's life history or events.",
      "usage_guideline": {
        "description": "Apply to represent substantive, identifiable multimedia materials relevant to biographical records, regardless of storage format.",
        "constraints": "Should cover only individual, discrete artifacts (files or objects); do not use for general classes of artifacts."
      }
    },
    {
      "name": "AncestryDetail",
      "description": "Information describing the lineage, ancestry, or hereditary background of a person, capturing genealogical details across generations.",
      "usage_guideline": {
        "description": "Use to record and represent specific genealogical information such as known ancestors, descent lines, or ancestral origins for a Person.",
        "constraints": "Should be used for well-documented ancestry or lineage records; not intended for vague or unsubstantiated claims."
      }
    },
    {
      "name": "IntergenerationalConnection",
      "description": "A relationship or linkage that represents a connection, pattern, or structure spanning multiple generations within a family or wider kin group.",
      "usage_guideline": {
        "description": "Apply to explicate generational relationships such as grandparent–grandchild, great-grandparent–descendant, or other lineages involving multi-generation spans.",
        "constraints": "Use to contextualize relationships that cross more than two generations; must specify relevant persons and generational gap."
      }
    },
    {
      "name": "EmploymentPeriod",
      "description": "A discrete period during which a person is employed in a specific job or role for a given employer, including starting and ending dates, job title, and location.",
      "usage_guideline": {
        "description": "Use to capture segments of an individual's work history tied to positions held, employers, job titles, and locations, distinguishing each continuous or discrete employment engagement.",
        "constraints": "Should include employment start/end dates, position, employer, and location. Model each job/role as a distinct instance; excludes periods of unemployment."
      }
    },
    {
      "name": "GeographicContext",
      "description": "A contextual factor that records the relevant geographic environment, scope, or location associated with a particular event, role, or background in a person's life.",
      "usage_guideline": {
        "description": "Use to provide additional geographic context relating to life events, roles, or background—not merely the event location but broader geographic influences (e.g. region of upbringing, context of employment).",
        "constraints": "May supplement occurredAtLocation; use when geographic circumstance is relevant to interpretation or biographical context."
      }
    },
    {
      "name": "CulturalContext",
      "description": "A context capturing the cultural, religious, or linguistic background factors that provide interpretive meaning to a person's life events or trajectory.",
      "usage_guideline": {
        "description": "Apply to link cultural, religious, or linguistic dimensions specifically to the contextualization of a person’s significant life events.",
        "constraints": "Do not use for generic cultural background (covered by hasCulturalBackground); instead use for interpretive contexts where background has explanatory or analytical significance for events."
      }
    },
    {
      "name": "NameType",
      "description": "A controlled categorization representing the type of name used by a person, such as 'legal', 'preferred', 'alias', or other meaningful distinctions.",
      "usage_guideline": {
        "description": "Use to specify the category or role of a given name within a person's NameHistory (e.g., distinguishing between formal/legal names, preferred names, pseudonyms, or informal aliases).",
        "constraints": "Use controlled vocabulary (such as 'legal', 'preferred', 'alias') for consistency. One type per NameHistory instance; not to be confused with context of use."
      }
    },
    {
      "name": "Award",
      "description": "A specific formal award, honor, or recognition conferred upon an individual by an organization, institution, or community in acknowledgment of notable achievement or contribution.",
      "usage_guideline": {
        "description": "Use to represent named awards, formal recognitions, or honors (e.g., prizes, medals, fellowships) distinct from informal achievements. Link to person/recipient and awarding context.",
        "constraints": "Should only include officially conferred awards or honors; does not cover informal achievements or minor recognitions."
      }
    },
    {
      "name": "InformalAchievement",
      "description": "A notable personal or professional accomplishment, recognition, or distinction achieved by an individual outside the scope of formal awards or honors.",
      "usage_guideline": {
        "description": "Use for significant but informal recognitions, such as community acknowledgments, major personal breakthroughs, or informal career/academic milestones.",
        "constraints": "Should represent meaningful achievements that have contextual relevance but lack official institutional recognition."
      }
    },
    {
      "name": "AwardingBody",
      "description": "An organization, institution, club, society, community group, or authoritative entity responsible for conferring awards, honors, or recognitions to individuals.",
      "usage_guideline": {
        "description": "Use to represent any body or authority that formally or informally grants awards or recognitions, including but not limited to professional societies, foundations, clubs, or community organizations.",
        "constraints": "Should be linked to awards/recognitions they confer and the contexts in which they operate."
      }
    },
    {
      "name": "AnnotationAttachment",
      "description": "A structured association linking an annotation, commentary, or interpretive note to a specific element of structured biographical data, such as a life event, relationship, or data segment.",
      "usage_guideline": {
        "description": "Use for modeling the explicit attachment or linkage of external annotations, commentaries, or interpretive contributions to existing structured biographical data.",
        "constraints": "Should represent the mechanism or context of attachment, and not duplicate direct annotation/content nodes."
      }
    },
    {
      "name": "GroupMembership",
      "description": "A record or episode representing a person's membership and participation in a defined group, including formal organizations, community groups, or networks, with associated roles, periods, and statuses.",
      "usage_guideline": {
        "description": "Use to explicitly model individual group membership episodes to track the group, role(s) held, duration, and membership status (e.g., active, former). Distinguish from broader network participation or informal social connections.",
        "constraints": "Each instance should represent one person's membership in one group during a specific period; use additional object/data properties to specify details."
      }
    },
    {
      "name": "InformalNetwork",
      "description": "A type of group or collective formed through less formalized, possibly online or ad hoc, social, professional, or interest-based association, lacking clear organizational structure.",
      "usage_guideline": {
        "description": "Use to represent online, digital, or unstructured groups that are relevant to biographical analysis when group structure or continuity is not formalized.",
        "constraints": "Do not use for formal organizations or community groups with enduring identities; should be used for networks where boundaries and membership are fluid."
      }
    },
    {
      "name": "LineageRecord",
      "description": "A structured record representing a documented line of descent, ancestry, or genealogical pathway across multiple generations within a family or community.",
      "usage_guideline": {
        "description": "Use to model explicit descent, ancestry, or lineage records that connect individuals through generational pathways; supports analysis of family or community genealogies.",
        "constraints": "Establish links between multiple Person instances according to documentable lines of descent or ancestral connection; only use for substantiated relationships."
      }
    },
    {
      "name": "DisabilityEvent",
      "description": "A significant life event in which a person acquires, experiences, or recovers from a physical, sensory, intellectual, or mental disability. This can include the onset of a disability, periods of adaptation, rehabilitation, and recovery episodes if applicable.",
      "usage_guideline": {
        "description": "Use to explicitly represent major episodes where disability status changes (onset, diagnosis, recovery, significant adaptation) are part of a person's life history or records. Should distinguish between chronic, temporary, or resolved disabilities where relevant.",
        "constraints": "Should only be used for consequential disability-related events, as documented or known within personal records."
      }
    },
    {
      "name": "RecoveryEvent",
      "description": "A life event marking a notable recovery from a disability or major health event, representing the conclusion or substantial improvement of a disabling condition.",
      "usage_guideline": {
        "description": "Use to record documented and meaningful episodes where an individual recovers from a disability or major health crisis, particularly when rehabilitation or restoration of function is significant to the life narrative.",
        "constraints": "Should be used when recovery is medically/biographically significant; omit for minor or transient recoveries."
      }
    },
    {
      "name": "ProfessionalRecognition",
      "description": "A formal or notable informal acknowledgment of an individual's professional accomplishments, competence, or distinction, occurring within the context of their career history. Includes professional awards, honors, titles, fellow/fellowship election, peer recognitions, and other status-marking events.",
      "usage_guideline": {
        "description": "Use to represent substantial recognitions such as professional society fellowships, honorary titles, or formal designations. Should also be used for informal but widely acknowledged professional achievements not covered by awards or certifications.",
        "constraints": "Exclude recognitions that are trivial, purely ceremonial, or do not reflect genuine professional achievement."
      }
    },
    {
      "name": "CertificationAchievement",
      "description": "An official certification obtained by an individual as part of their career, granted to attest to specific professional competence or qualification.",
      "usage_guideline": {
        "description": "Use for modeling the achievement of professional certifications that are career-relevant, such as licensure, board certification, or other formal attestations not captured by educational Credential.",
        "constraints": "Apply only to recognized certifications with formal assessment and/or issuing body."
      }
    },
    {
      "name": "InformalProfessionalAchievement",
      "description": "A notable informal achievement in a professional context that is recognized by peers, communities, or organizations but does not rise to the level of a formal award or certification.",
      "usage_guideline": {
        "description": "Use for accomplishments such as peer-elected positions, informal community recognitions, or significant milestones acknowledged by professional networks.",
        "constraints": "Should not be used for routine performance but only for widely acknowledged, contextually meaningful achievements."
      }
    },
    {
      "name": "ChronologicalSequence",
      "description": "An ordered sequence representing the precise chronological ordering of life events, narratives, or testimonies in a person's history.",
      "usage_guideline": {
        "description": "Use to model the explicit temporal arrangement of major events, testimonies, or narrative elements when sequencing or ordering is analytically required.",
        "constraints": "Should be used for comprehensive or focal sequences; do not use for unordered collections or aggregates."
      }
    },
    {
      "name": "GeographicMapping",
      "description": "A structured representation depicting the mapping of life events, episodes, or narratives to geographic coordinates, locations, or regions within a person's history.",
      "usage_guideline": {
        "description": "Use to establish and document the geographic context or visual mapping of events, allowing events to be related or visualized geographically.",
        "constraints": "Should supplement, not replace, basic location linkage; use for spatial visualizations, mapping, or geographic analyses."
      }
    },
    {
      "name": "NonTraditionalPathway",
      "description": "A deviation or variation from the expected or typical sequence of life events, educational progression, or career development, including interruptions, breaks, or alternative routes.",
      "usage_guideline": {
        "description": "Use to annotate or classify educational or career trajectories that are disrupted, delayed, interrupted, or otherwise depart from standard patterns.",
        "constraints": "Should only be applied where explicit documentation or evidence of deviation from normative pathway exists."
      }
    },
    {
      "name": "NarrativeEpisode",
      "description": "A discrete segment or portion of a personal narrative, oral history, or testimonial account, corresponding to a specific life event or period.",
      "usage_guideline": {
        "description": "Use to divide longer narratives, oral histories, or testimonies into identifiable segments directly relating to particular events or periods.",
        "constraints": "Should be mapped explicitly to related LifeEvent instances or specific periods. Not interchangeable with QualitativeAnnotation."
      }
    },
    {
      "name": "Specialization",
      "description": "A specific focus or concentration within a broader field of study or discipline that an individual pursues during an educational or professional trajectory.",
      "usage_guideline": {
        "description": "Use to represent the major or concentrated area of academic or professional expertise pursued by a person. Specializations are often more specific than broad fields of study and may be nested within them.",
        "constraints": "Should be used to capture distinct, named concentrations within recognized fields; link to FieldOfStudy or EducationEpisode as appropriate."
      }
    }
  ],
  "subclass_relations": [
    {
      "subclass": "Marriage",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "Divorce",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "Childbirth",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "Adoption",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "HealthCrisis",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "Migration",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "Retirement",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "UncertainEvent",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "CommunityGroup",
      "superclass": "Organization"
    },
    {
      "subclass": "Document",
      "superclass": "Source"
    },
    {
      "subclass": "Testimony",
      "superclass": "Source"
    },
    {
      "subclass": "EducationInterruption",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "CareerInterruption",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "ResumptionEvent",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "UnemploymentPeriod",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "Recognition",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "DigitalArtifact",
      "superclass": "Source"
    },
    {
      "subclass": "Relocation",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "Travel",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "EnvironmentalDisruption",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "EconomicDisruption",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "SocietalDisruption",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "Institution",
      "superclass": "Organization"
    },
    {
      "subclass": "LegalEvent",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "NameChange",
      "superclass": "LegalEvent"
    },
    {
      "subclass": "StatusChange",
      "superclass": "LegalEvent"
    },
    {
      "subclass": "CourtCase",
      "superclass": "LegalEvent"
    },
    {
      "subclass": "CitizenshipChange",
      "superclass": "LegalEvent"
    },
    {
      "subclass": "SensitivePersonalData",
      "superclass": "SensitiveInformation"
    },
    {
      "subclass": "NonFormalLearningExperience",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "InformalLearningExperience",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "OfficialIdentifier",
      "superclass": "RecordElement"
    },
    {
      "subclass": "DemographicAttribute",
      "superclass": "RecordElement"
    },
    {
      "subclass": "LifeMilestone",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "Disruption",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "Apprenticeship",
      "superclass": "InformalLearningExperience"
    },
    {
      "subclass": "SelfTaughtLearning",
      "superclass": "InformalLearningExperience"
    },
    {
      "subclass": "CommunityInstruction",
      "superclass": "InformalLearningExperience"
    },
    {
      "subclass": "SabbaticalPeriod",
      "superclass": "CareerInterruption"
    },
    {
      "subclass": "Promotion",
      "superclass": "CareerMilestone"
    },
    {
      "subclass": "Demotion",
      "superclass": "CareerMilestone"
    },
    {
      "subclass": "EntrepreneurialActivity",
      "superclass": "CareerMilestone"
    },
    {
      "subclass": "MultimediaArtifact",
      "superclass": "DigitalArtifact"
    },
    {
      "subclass": "EmploymentPeriod",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "DisabilityEvent",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "RecoveryEvent",
      "superclass": "LifeEvent"
    },
    {
      "subclass": "ProfessionalRecognition",
      "superclass": "CareerMilestone"
    },
    {
      "subclass": "CertificationAchievement",
      "superclass": "CareerMilestone"
    },
    {
      "subclass": "InformalProfessionalAchievement",
      "superclass": "CareerMilestone"
    }
  ],
  "object_properties": [
    {
      "name": "hasLifeEvent",
      "description": "Relates a person to a specific life event they have experienced.",
      "domain": [
        "Person"
      ],
      "range": [
        "LifeEvent"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to associate one or more life events with a person.",
        "constraints": "A person may have multiple life events."
      }
    },
    {
      "name": "occurredAtLocation",
      "description": "Relates a life event to the geospatial location where it took place.",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "Location"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to specify the location of a significant life event.",
        "constraints": "A life event should be linked to at least one location."
      }
    },
    {
      "name": "involvedPerson",
      "description": "Relates a life event to a person who was involved in it.",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use when the event involves people other than the primary subject (e.g., parents in a childbirth event, both partners in a marriage).",
        "constraints": "Should not duplicate information from the main hasLifeEvent property."
      }
    },
    {
      "name": "relatesPerson",
      "description": "Indicates the person to whom a family relationship applies (the related individual).",
      "domain": [
        "FamilyRelationship"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to indicate the second person involved in a family relationship; the first person is represented by the subject.",
        "constraints": "There must always be two persons involved in a family relationship."
      }
    },
    {
      "name": "hasFamilyRelationship",
      "description": "Associates a person with a family relationship they are a part of.",
      "domain": [
        "Person"
      ],
      "range": [
        "FamilyRelationship"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link a Person to explicit FamilyRelationship instances.",
        "constraints": "A person may have multiple family relationships."
      }
    },
    {
      "name": "isMemberOfTimeline",
      "description": "Indicates that a life event is included within a given timeline.",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "Timeline"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to associate multiple life events to a timeline for visualization or reasoning.",
        "constraints": "Each life event can be part of one or more timelines depicting different narrative perspectives."
      }
    },
    {
      "name": "isConcurrentWith",
      "description": "Indicates that two life events occurred with temporal overlap—either partially or fully—during an individual’s timeline.",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "LifeEvent"
      ],
      "characteristics": [
        "symmetric"
      ],
      "usage_guideline": {
        "description": "Use this property to explicitly link events that occurred at overlapping times (e.g., holding a job while attending school).",
        "constraints": "Should only be used for events belonging to the same individual or narrative."
      }
    },
    {
      "name": "precedesEvent",
      "description": "Denotes that one life event occurs before another event in a person’s timeline, establishing a temporal ordering.",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "LifeEvent"
      ],
      "characteristics": [
        "asymmetric",
        "irreflexive",
        "transitive"
      ],
      "usage_guideline": {
        "description": "Apply to relate events in strict temporal sequence, supporting queries over event orderings.",
        "constraints": "Should not be used when explicit ordering is not known or is ambiguous; do not create circular chains."
      }
    },
    {
      "name": "hasAffiliation",
      "description": "Denotes a person’s formal or informal association with an organization or group, such as employers, academic institutions, or clubs.",
      "domain": [
        "Person"
      ],
      "range": [
        "Organization"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to link persons to organizations or collectives with which they are connected (employment, membership, etc).",
        "constraints": "Affiliation may be time-bound; details should be explicit where known."
      }
    },
    {
      "name": "hasAffiliationPeriod",
      "description": "Relates an affiliation between a person and an organization (or community group) to the calendar period during which the affiliation was valid or active.",
      "domain": [
        "Person"
      ],
      "range": [
        "Organization"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply when an affiliation is limited to a specific time interval—use with properties indicating start and end dates. Each time-bound membership should be modeled as a distinct relationship.",
        "constraints": "Where known, both dates should be provided; use only the known endpoint if the full period is uncertain."
      }
    },
    {
      "name": "heldAffiliationRole",
      "description": "Identifies the role or title a person held in an organization or group during their affiliation period.",
      "domain": [
        "Person"
      ],
      "range": [
        "AffiliationRole"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Each instance of a person-organization affiliation may be linked to a specific role or multiple roles as appropriate. Roles help specify the nature of a person's participation.",
        "constraints": "Set as functional when the role is unique to a given affiliation period; allow multiples only if the modeling context requires tracking changes of role within a single continuous affiliation."
      }
    },
    {
      "name": "documentsLifeEvent",
      "description": "Links a source (document, record, testimony) to the life event(s) that it describes, documents, or attests to.",
      "domain": [
        "Source"
      ],
      "range": [
        "LifeEvent"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to represent the evidentiary connection from sources to the events they document. One source can document multiple events, and events can be documented by multiple sources.",
        "constraints": null
      }
    },
    {
      "name": "hasSocialRelationship",
      "description": "Links a person to a specific social or professional relationship in which they participate (e.g., mentorship, friendship, collegial ties).",
      "domain": [
        "Person"
      ],
      "range": [
        "SocialRelationship"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use for connecting each person involved in a non-familial relationship to the SocialRelationship instance.",
        "constraints": "One SocialRelationship may include more than two persons if needed to represent a group."
      }
    },
    {
      "name": "relatesPersonInSocialRelationship",
      "description": "Indicates another person involved in a particular SocialRelationship.",
      "domain": [
        "SocialRelationship"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to list all individuals participating in a given social or professional relationship.",
        "constraints": "Each SocialRelationship should reference all relevant parties."
      }
    },
    {
      "name": "isPartOfSocialNetwork",
      "description": "Indicates that a person is part of a larger social or professional network or grouping.",
      "domain": [
        "Person"
      ],
      "range": [
        "SocialNetwork"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use this property to connect persons with the named or constructed social or professional networks to which they belong.",
        "constraints": "Networks can be loosely or tightly defined, as appropriate to context."
      }
    },
    {
      "name": "hasAuthorship",
      "description": "Identifies the person or persons who authored a document or source.",
      "domain": [
        "Document",
        "Source"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to explicitly link documents or sources with their author(s).",
        "constraints": "May have one or more authors. Do not use for editors, curators, or custodians unless these roles are clearly authors as well."
      }
    },
    {
      "name": "hasCustodian",
      "description": "Indicates the organization or individual responsible for the care, preservation, or custody of a document or source.",
      "domain": [
        "Document",
        "Source"
      ],
      "range": [
        "Organization",
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to specify the current or historical custodian (such as an archive, institution, or individual) of a source or document.",
        "constraints": "May reference organizations or persons; prefer organizational custodians for institutional records."
      }
    },
    {
      "name": "isAccountOfPerson",
      "description": "Indicates the individual whose life or experiences are documented in a specific testimony, autobiographical account, oral history, or narrative.",
      "domain": [
        "Testimony"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link testimony or narrative accounts to the subject individual. This allows distinguishing between testimonies given by different persons about different subjects.",
        "constraints": "May be multiple persons if a testimony describes a group."
      }
    },
    {
      "name": "isLinkedToMovement",
      "description": "Relates a life event or a person to a major social, political, or cultural movement with which they were associated.",
      "domain": [
        "LifeEvent",
        "Person"
      ],
      "range": [
        "Movement"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use this property to associate a person or an event with the movement(s) they participated in or were influenced by.",
        "constraints": "A person or event may be linked to multiple movements; use clearly defined Movement instances as range."
      }
    },
    {
      "name": "hasJobTitle",
      "description": "Associates a life event such as employment or career role with the specific job title held by a person during that period.",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "JobTitle"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to indicate precisely which job title was held during an employment episode or significant career event.",
        "constraints": "Each employment event should have only one job title per instance."
      }
    },
    {
      "name": "hasEmployer",
      "description": "Links a career-related life event to the employer (organization) associated with the position or employment.",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "Employer"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Apply to connect employment, career transition, or recognition events with the corresponding employer entity.",
        "constraints": "Each event references a single employer; use additional instances for multiple concurrent employers."
      }
    },
    {
      "name": "hasCareerRole",
      "description": "Associates a person's specific role or function with a career-related life event.",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "CareerRole"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to specify a role or set of duties a person performed during an employment or professional episode.",
        "constraints": "Role should be relevant to the period/event modeled."
      }
    },
    {
      "name": "hasCareerTransition",
      "description": "Links a person or their timeline to a specific career transition event.",
      "domain": [
        "Person",
        "Timeline"
      ],
      "range": [
        "CareerTransition"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to mark significant career changes or turning points in a person's trajectory.",
        "constraints": "Multiple transitions may occur within a single career."
      }
    },
    {
      "name": "hasUnemploymentPeriod",
      "description": "Associates a person or their timeline with a period in which they were not employed.",
      "domain": [
        "Person",
        "Timeline"
      ],
      "range": [
        "UnemploymentPeriod"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to highlight time intervals between jobs or careers.",
        "constraints": "Applicable wherever unemployment episodes are relevant to career trajectory."
      }
    },
    {
      "name": "hasRecognition",
      "description": "Links a person or their timeline to a recognition event or award received.",
      "domain": [
        "Person",
        "Timeline"
      ],
      "range": [
        "Recognition"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to document formal acknowledgments, awards, or honors in a person's history.",
        "constraints": "Multiple recognitions may be linked."
      }
    },
    {
      "name": "hasConsent",
      "description": "Indicates that explicit consent has been granted regarding the use, sharing, or annotation of an individual's personal, biographical, or life history data.",
      "domain": [
        "Person"
      ],
      "range": [
        "Consent"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to denote formal, documented consent agreements regarding data usage.",
        "constraints": "One consent relation per person per context; record relevant metadata via linked properties."
      }
    },
    {
      "name": "grantedBy",
      "description": "Identifies the agent (person or organization) who granted formal consent for a specific data usage, sharing, or annotation.",
      "domain": [
        "Consent"
      ],
      "range": [
        "Person",
        "Organization"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to make explicit the source of authorization for a given consent.",
        "constraints": "Consent must be associated with one, and only one, granter per instance."
      }
    },
    {
      "name": "hasLifeNarrative",
      "description": "Associates a person with an overarching life narrative or biographical storyline that summarizes or contextualizes their life history.",
      "domain": [
        "Person"
      ],
      "range": [
        "LifeNarrative"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link an individual to synthesized biographical or narrative accounts describing their life in thematic or holistic terms.",
        "constraints": "Multiple narratives may exist for a single person (e.g., multiple biographies or thematic interpretations)."
      }
    },
    {
      "name": "contextualizesEvent",
      "description": "Relates a life narrative or qualitative annotation to the specific life event(s) it contextualizes, interprets, or supplements.",
      "domain": [
        "LifeNarrative",
        "QualitativeAnnotation"
      ],
      "range": [
        "LifeEvent"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to explicitly identify which LifeEvent(s) are being contextualized or interpreted by a particular narrative or annotation.",
        "constraints": "A narrative or annotation may contextualize one or multiple events."
      }
    },
    {
      "name": "hasQualitativeAnnotation",
      "description": "Links a life event or life narrative to one or more qualitative annotations providing contextual or interpretive commentary.",
      "domain": [
        "LifeEvent",
        "LifeNarrative"
      ],
      "range": [
        "QualitativeAnnotation"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to attach textual or interpretive notes to events or narratives for richer, nuanced representation.",
        "constraints": "Multiple annotations may apply. Distinct from uncertainty notes, which specifically address incomplete or ambiguous information."
      }
    },
    {
      "name": "isAssociatedWithEvent",
      "description": "Links a digital artifact to the life event or episode with which it is associated.",
      "domain": [
        "DigitalArtifact"
      ],
      "range": [
        "LifeEvent"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to trace the evidentiary or contextual relationship between a digital artifact (e.g., photo, certificate) and a specific event in a person's life.",
        "constraints": "Artifacts may be associated with multiple events if relevant; each association should be explicit."
      }
    },
    {
      "name": "hasPrivacyRestriction",
      "description": "Links a person or their associated data to a specific privacy restriction applied to that data.",
      "domain": [
        "Person"
      ],
      "range": [
        "PrivacyRestriction"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to associate explicit privacy rules, restrictions, or flagged limitations with individual-level data or records.",
        "constraints": "Multiple restrictions can be associated with a single person; combine with consent mechanisms where required."
      }
    },
    {
      "name": "hasSensitiveInformation",
      "description": "Indicates that a person, life event, or digital artifact contains or is marked as sensitive information requiring special handling.",
      "domain": [
        "Person",
        "LifeEvent",
        "DigitalArtifact"
      ],
      "range": [
        "SensitiveInformation"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to flag specific records, events, or digital objects that are recognized as especially sensitive or requiring protection.",
        "constraints": "Apply only where special risk, confidentiality, or protection status is justified."
      }
    },
    {
      "name": "isGovernedByAccessControlPolicy",
      "description": "Specifies that a person, digital artifact, or life event is subject to a particular access control policy.",
      "domain": [
        "Person",
        "DigitalArtifact",
        "LifeEvent"
      ],
      "range": [
        "AccessControlPolicy"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply this property to connect data or artifacts to the concrete access control configuration or policy governing their handling.",
        "constraints": "An instance may be governed by multiple policies if applicable, such as layered or hierarchical controls."
      }
    },
    {
      "name": "mapsGeographically",
      "description": "Indicates the linkage between a life event and its representation via geographic mapping (such as geocoordinates, regions, or map visualizations).",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "Location"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use when associating a life event with its detailed geographic mapping or coordinates, supporting spatial reasoning or visualization.",
        "constraints": "May be used alongside occurredAtLocation for events covering multiple mapped points, routes, or areas."
      }
    },
    {
      "name": "mapsTemporally",
      "description": "Links a life event or series of events to a temporal sequence, timeline, or periodization scheme for mapping them in time.",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "Timeline"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to support advanced temporal mapping, sequencing, or visualization of life event histories.",
        "constraints": "Intended for temporal analysis or when events are part of a narrative time map."
      }
    },
    {
      "name": "hasImpactOnLifeEvent",
      "description": "Specifies that a disruption event (environmental, economic, societal) has an effect on one or more life events or milestones experienced by a person.",
      "domain": [
        "LifeEvent"
      ],
      "range": [
        "LifeEvent"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to represent explicit impact or causal linkage from a disruption event to subsequent or contingent life events (e.g., a pandemic causing an interruption in education).",
        "constraints": "Should link only when there is a evidenced or narratively relevant connection."
      }
    },
    {
      "name": "hasAnnotation",
      "description": "Relates a life event, life narrative, or person to one or more annotations, semantic tags, or commentaries that enrich or clarify the underlying data.",
      "domain": [
        "LifeEvent",
        "LifeNarrative",
        "Person"
      ],
      "range": [
        "Annotation"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use this property to link biographical entities to enrichment annotations, semantic tags, or scholarly commentaries on life data.",
        "constraints": "Multiple annotations may be associated with any entity. Use for structured, enriched, or semantic tagging beyond qualitative commentary."
      }
    },
    {
      "name": "hasVerificationStatus",
      "description": "Specifies the verification or evidentiary status of a life event, annotation, or life narrative entry, based on available sources or assessment.",
      "domain": [
        "LifeEvent",
        "Annotation",
        "LifeNarrative"
      ],
      "range": [
        "VerificationStatus"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Assign to indicate the evidentiary confidence or validation of a given entry, annotation, or event. Supports data quality queries and evidence-based filtering.",
        "constraints": "Each item should have one verification status if assessed; omit only if status is unknown."
      }
    },
    {
      "name": "hasEducationEpisode",
      "description": "Links a person to a specific education episode representing a discrete part of their educational trajectory.",
      "domain": [
        "Person"
      ],
      "range": [
        "EducationEpisode"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to associate each person with the full set of educational episodes they have experienced.",
        "constraints": "A person may have multiple education episodes throughout their life."
      }
    },
    {
      "name": "isEnrolledInProgram",
      "description": "Specifies the program in which a person or education episode is enrolled.",
      "domain": [
        "EducationEpisode"
      ],
      "range": [
        "Program"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to indicate the specific program a person followed during an education episode.",
        "constraints": "One program per education episode; model multiple separate episodes if an individual changes program."
      }
    },
    {
      "name": "isAtInstitution",
      "description": "Indicates the institution where an education episode takes place.",
      "domain": [
        "EducationEpisode"
      ],
      "range": [
        "Institution"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to explicitly connect each education episode to the school, college, or university attended.",
        "constraints": "Each education episode should be linked to one primary institution; for joint/dual programs, model as separate episodes."
      }
    },
    {
      "name": "hasFieldOfStudy",
      "description": "Links an education episode or program to its principal field of study.",
      "domain": [
        "EducationEpisode",
        "Program"
      ],
      "range": [
        "FieldOfStudy"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use for representing the area/discipline associated with the education episode or program.",
        "constraints": "One primary field per episode/program; use additional properties if significant multi-disciplinary study occurs."
      }
    },
    {
      "name": "receivedCredential",
      "description": "Relates an education episode where a credential, diploma, or degree was awarded upon completion.",
      "domain": [
        "EducationEpisode"
      ],
      "range": [
        "Credential"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Link an education episode to the formal credential received (if any) at its conclusion.",
        "constraints": "Only use if a credential was in fact conferred; leave blank if no credential awarded."
      }
    },
    {
      "name": "hasMentorship",
      "description": "Links a person to a mentorship relationship in which they are either mentor or mentee.",
      "domain": [
        "Person"
      ],
      "range": [
        "Mentorship"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Associate a person with each mentorship relation in which they participate, regardless of their role.",
        "constraints": "Each mentorship should reference at least two persons (mentor and mentee)."
      }
    },
    {
      "name": "hasMentor",
      "description": "Indicates the person fulfilling the mentor role in a mentorship relationship.",
      "domain": [
        "Mentorship"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to specify the primary mentor in a mentorship instance.",
        "constraints": "One mentor per mentorship instance. Model group/peer mentoring as multiple mentorships if needed."
      }
    },
    {
      "name": "hasMentee",
      "description": "Indicates the person receiving mentorship and guidance in a mentorship relationship.",
      "domain": [
        "Mentorship"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to specify the primary mentee or beneficiary in a mentorship instance.",
        "constraints": "One mentee per mentorship instance. Model multiple mentees as distinct mentorships if necessary."
      }
    },
    {
      "name": "hasSocioEconomicStatusChange",
      "description": "Links a person to a specific change or transition in their socio-economic status, facilitating modeling of status evolution over the life course.",
      "domain": [
        "Person"
      ],
      "range": [
        "SocioEconomicStatusChange"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to represent key points where a person's socio-economic status shifted (e.g., upward or downward mobility).",
        "constraints": "Only use when status change is significant and can be substantiated."
      }
    },
    {
      "name": "hasLegalEvent",
      "description": "Associates a person with a legal event that has affected their identity or life trajectory.",
      "domain": [
        "Person"
      ],
      "range": [
        "LegalEvent"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to connect each person to the legal events in which they have participated or been affected.",
        "constraints": "A person may be associated with multiple legal events."
      }
    },
    {
      "name": "hasCareerMilestone",
      "description": "Links a person to significant achievements, positions, or other notable milestones in their career history.",
      "domain": [
        "Person"
      ],
      "range": [
        "CareerMilestone"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to represent major points in a person's professional development, such as promotions, appointments, awards, or transitions.",
        "constraints": "A person may have multiple career milestones; use only for milestones of major relevance."
      }
    },
    {
      "name": "hasArchivalStatus",
      "description": "Specifies the archival status of a record element, such as active, archived, or uncertain.",
      "domain": [
        "RecordElement"
      ],
      "range": [
        "ArchivalStatus"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Associate each record element with its current archival status using controlled values for consistency.",
        "constraints": "Should have at most one status per record element at a given time."
      }
    },
    {
      "name": "isRecordElementOf",
      "description": "Relates a record element to the person whom the record concerns.",
      "domain": [
        "RecordElement"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to indicate which person a given record element belongs to or describes.",
        "constraints": "Each record element should be linked to a specific person."
      }
    },
    {
      "name": "hasMigrationPathway",
      "description": "Links a person to their migration pathway, which encodes multi-stage movement, origins, destinations, and associated events.",
      "domain": [
        "Person"
      ],
      "range": [
        "MigrationPathway"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to associate an individual with their overall migration trajectory, as distinct from a single migration event.",
        "constraints": "A person may have zero or more migration pathways."
      }
    },
    {
      "name": "hasOrigin",
      "description": "Specifies the starting location of a migration pathway or episode.",
      "domain": [
        "MigrationPathway"
      ],
      "range": [
        "Location"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to indicate the geographic starting point of a migration trajectory.",
        "constraints": "Only one origin per migration pathway."
      }
    },
    {
      "name": "hasDestination",
      "description": "Specifies the final or target location reached at the end of a migration pathway or episode.",
      "domain": [
        "MigrationPathway"
      ],
      "range": [
        "Location"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Indicate the intended or arrived-at location for each migration pathway.",
        "constraints": "Only one primary destination should be modeled; for multi-stage/destinations, use additional pathways."
      }
    },
    {
      "name": "includesRelocationEpisode",
      "description": "Links a migration pathway to specific episodes of relocation or resettlement that comprise it.",
      "domain": [
        "MigrationPathway"
      ],
      "range": [
        "Relocation"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to associate each migration pathway with the set of relocation or resettlement events that are part of it.",
        "constraints": "A pathway may include multiple relocations or resettlements; list each episode separately."
      }
    },
    {
      "name": "hasHouseholdComposition",
      "description": "Links a person or timeline to a specific household composition present at a given time.",
      "domain": [
        "Person",
        "Timeline"
      ],
      "range": [
        "HouseholdComposition"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to indicate the household(s) an individual is part of at specific times or in particular periods.",
        "constraints": "Multiple compositions may be linked to a person or timeline if they change over time."
      }
    },
    {
      "name": "hasLivingArrangement",
      "description": "Associates a person or timeline with a particular living arrangement or context at a given time.",
      "domain": [
        "Person",
        "Timeline"
      ],
      "range": [
        "LivingArrangement"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to describe current or historical living contexts for an individual.",
        "constraints": "A person may have multiple living arrangements through their life history."
      }
    },
    {
      "name": "isMemberOfHousehold",
      "description": "Indicates that a person is a member of a given household composition at a point in time.",
      "domain": [
        "Person"
      ],
      "range": [
        "HouseholdComposition"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to model membership of a person in a household for the relevant composition instance.",
        "constraints": "Multiple persons may be members of one household; a person may be member of different households at different times."
      }
    },
    {
      "name": "hasSensitivePersonalData",
      "description": "Indicates that a person or record element contains or references sensitive personal information requiring heightened protection.",
      "domain": [
        "Person",
        "RecordElement"
      ],
      "range": [
        "SensitivePersonalData"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link a person or their record elements to specific sensitive data types for privacy and compliance management.",
        "constraints": "Apply only where data meets the domain or regulatory definition of sensitive personal data."
      }
    },
    {
      "name": "isManagedByPrivacyMechanism",
      "description": "Specifies the privacy management mechanism in use for a given sensitive data item, person, or record element.",
      "domain": [
        "SensitivePersonalData",
        "Person",
        "RecordElement"
      ],
      "range": [
        "PrivacyManagementMechanism"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Link sensitive information or blocks of personal data to the policy, technical, or procedural mechanism governing its privacy management.",
        "constraints": "Multiple mechanisms may apply to a single data item; record associations as appropriate."
      }
    },
    {
      "name": "isGovernedByEthicalGuideline",
      "description": "Relates a consent, privacy restriction, or sensitive personal data to the ethical guideline or framework governing its handling.",
      "domain": [
        "Consent",
        "PrivacyRestriction",
        "SensitivePersonalData"
      ],
      "range": [
        "EthicalGuideline"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to record reference to one or more ethical codes or guidelines applicable to the data's management.",
        "constraints": "Reference only external, recognized ethical codes or standards."
      }
    },
    {
      "name": "tagsEntityWithQualitativeTag",
      "description": "Associates an entity (person, record, event, or narrative) with one or more qualitative tags for thematic enrichment and qualitative analysis.",
      "domain": [
        "Person",
        "LifeEvent",
        "LifeNarrative",
        "RecordElement"
      ],
      "range": [
        "QualitativeTag"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link various entities to qualitative tags reflecting interpretive content, theme, or analyst’s perspective.",
        "constraints": "Multiple tags permitted per entity; do not duplicate structured annotation. Intended for unstructured qualitative tagging or coding."
      }
    },
    {
      "name": "hasNonFormalLearningExperience",
      "description": "Links a person to an organized, structured, non-formal learning experience they participated in during their life trajectory.",
      "domain": [
        "Person"
      ],
      "range": [
        "NonFormalLearningExperience"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to capture a comprehensive learning history. Link to provider, topic, and result where available.",
        "constraints": "Multiple non-formal episodes can be modeled for a person. Distinct from formal EducationEpisode and informal learning."
      }
    },
    {
      "name": "hasInformalLearningExperience",
      "description": "Associates a person with an informal learning experience or episode relevant to their educational trajectory.",
      "domain": [
        "Person"
      ],
      "range": [
        "InformalLearningExperience"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to model non-structured, lived, or social/community-based learning events. Record context, source, or topic if possible.",
        "constraints": "Multiple informal episodes may be present; use for learning not otherwise categorized."
      }
    },
    {
      "name": "hasOfficialIdentifier",
      "description": "Links a person to an official identifier, such as a national ID, passport number, or similar authentication reference.",
      "domain": [
        "Person"
      ],
      "range": [
        "OfficialIdentifier"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use for recording government-issued or authoritative identifiers for individuals.",
        "constraints": "Multiple identifiers may be associated with a single person if applicable."
      }
    },
    {
      "name": "hasPhotograph",
      "description": "Links a person to a digital artifact or record representing their photograph, portrait, or likeness.",
      "domain": [
        "Person"
      ],
      "range": [
        "DigitalArtifact"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use for associating photographs with biographical records; distinguish by artifact type if necessary.",
        "constraints": "Only include images providing personal identification or biographical relevance."
      }
    },
    {
      "name": "hasDemographicAttribute",
      "description": "Associates a person with a specific demographic attribute record (such as gender, ethnicity, nationality, etc).",
      "domain": [
        "Person"
      ],
      "range": [
        "DemographicAttribute"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use for explicit modeling when details or sources of demographic assignment need to be referenced or traced.",
        "constraints": "Multiple demographic attributes may be associated with a person."
      }
    },
    {
      "name": "hasMembershipStatus",
      "description": "States the status of a person's affiliation or membership in an organization, association, or community group.",
      "domain": [
        "Person"
      ],
      "range": [
        "MembershipStatus"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to encode a person’s current or historic membership status in a group/organization context.",
        "constraints": "Use distinct instances for each organization, period, or role; status may change over time."
      }
    },
    {
      "name": "isContextualizedBy",
      "description": "Associates a life milestone, life event, or other biographical element with an environmental or contextual factor (e.g., traditions, regional events, disruptions) relevant to its interpretation.",
      "domain": [
        "LifeEvent",
        "LifeMilestone"
      ],
      "range": [
        "ContextualFactor"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to make explicit the contextual influences shaping or affecting a life event or milestone.",
        "constraints": "Multiple contextual factors may relate to a single event."
      }
    },
    {
      "name": "alignsWithMilestone",
      "description": "Relates an environmental or contextual factor (such as a regional event or tradition) to a specific milestone in a person’s life history that it aligns with or influences.",
      "domain": [
        "ContextualFactor"
      ],
      "range": [
        "LifeMilestone"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use for modeling the alignment or overlap of contextual events/traditions with significant biographical milestones.",
        "constraints": "Multiple alignments may be possible; should be used when the correspondence is historically or narratively meaningful."
      }
    },
    {
      "name": "hasDataAccessRecord",
      "description": "Associates a person or their life history data with a specific data access record.",
      "domain": [
        "Person"
      ],
      "range": [
        "DataAccessRecord"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link individuals to records of who has accessed their data.",
        "constraints": "Multiple access records may exist per person."
      }
    },
    {
      "name": "wasAccessedBy",
      "description": "Indicates the agent (person or organization) who accessed the individual's data, as captured in a data access record.",
      "domain": [
        "DataAccessRecord"
      ],
      "range": [
        "Person",
        "Organization"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to record the accessing party per access event.",
        "constraints": "One agent per DataAccessRecord."
      }
    },
    {
      "name": "isLinkedToConsent",
      "description": "Indicates the specific Consent record under which a data access record was authorized.",
      "domain": [
        "DataAccessRecord"
      ],
      "range": [
        "Consent"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Connect each instance of DataAccessRecord to the Consent authorizing the access.",
        "constraints": "One consent per access; required for compliance tracking."
      }
    },
    {
      "name": "hasNameHistory",
      "description": "Links a person to their record(s) of historical names.",
      "domain": [
        "Person"
      ],
      "range": [
        "NameHistory"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to reference all instances of a person's names used at different times.",
        "constraints": "Multiple NameHistory instances per individual are permitted."
      }
    },
    {
      "name": "hasLegalStatusHistory",
      "description": "Links a person to their history of legal statuses.",
      "domain": [
        "Person"
      ],
      "range": [
        "LegalStatusHistory"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use for associating a person with all legal statuses held during their life.",
        "constraints": "Multiple histories can coexist if statuses changed repeatedly."
      }
    },
    {
      "name": "hasIdentifierHistory",
      "description": "Links a person to historical records of their official identifiers.",
      "domain": [
        "Person"
      ],
      "range": [
        "IdentifierHistory"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to reference all former and current official identifiers for an individual.",
        "constraints": "Multiple IdentifierHistory records per person allowed."
      }
    },
    {
      "name": "wasTriggeredByEvent",
      "description": "Links a NameHistory, LegalStatusHistory, or IdentifierHistory record to the LifeEvent or LegalEvent that prompted the change.",
      "domain": [
        "NameHistory",
        "LegalStatusHistory",
        "IdentifierHistory"
      ],
      "range": [
        "ChangeTriggerEvent"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to declare the event responsible for changes to names, statuses, or identifiers.",
        "constraints": "One causative event per change record."
      }
    },
    {
      "name": "hasStatusIndicator",
      "description": "Associates a record element or data point in a person's life story with a status indicator describing its current state or reliability.",
      "domain": [
        "RecordElement"
      ],
      "range": [
        "StatusIndicator"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to record or track the status (e.g., 'active', 'archived', etc.) of individual data elements in biographical or life history records.",
        "constraints": "Only one status indicator per record element at a time; do not use for entire person or event classes."
      }
    },
    {
      "name": "grantsConsentPermission",
      "description": "Indicates that a consent record grants a specific permission or access condition regarding the use or sharing of personal life history data.",
      "domain": [
        "Consent"
      ],
      "range": [
        "ConsentPermission"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link each consent with the specific permissions or access rights it provides.",
        "constraints": "Multiple permissions may be granted per consent; each permission should describe a distinct right or condition."
      }
    },
    {
      "name": "isOrderedInSequence",
      "description": "Indicates that an education episode or institution occurs at a specific position in an educational sequence, supporting explicit chronological ordering.",
      "domain": [
        "EducationEpisode",
        "Institution"
      ],
      "range": [
        "EducationalSequence"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply this property to relate an EducationEpisode or Institution to its containing EducationalSequence. Sequencing order should be specified using position or ordering data property.",
        "constraints": "Use alongside hasSequenceOrder where explicit order/index is needed."
      }
    },
    {
      "name": "complementsFormalEducation",
      "description": "Indicates that an informal learning experience supplements or enhances a person's formal educational trajectory.",
      "domain": [
        "InformalLearningExperience"
      ],
      "range": [
        "EducationEpisode"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to explicitly relate informal learning experiences to formal EducationEpisodes they complement, extend, or enhance.",
        "constraints": "Multiple informal learning experiences may complement the same formal episode; relation should be used where the complementary nature is evidenced or asserted."
      }
    },
    {
      "name": "hasIntersectionalContext",
      "description": "Associates a person, life event, or biographical episode with a defined intersectional context, capturing the interplay of multiple identity factors or statuses.",
      "domain": [
        "Person",
        "LifeEvent"
      ],
      "range": [
        "IntersectionalContext"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to explicitly link persons or life events to the intersectional contexts that have shaped, constrained, or informed their experiences. Especially relevant for representing multicultural, minority, or overlapping identity factors.",
        "constraints": "An entity may have multiple intersectional contexts; each association should reference a distinct set of intersecting identities or statuses."
      }
    },
    {
      "name": "hasTemporalDetail",
      "description": "Links a migration, relocation, or travel event to its associated temporal details (e.g., timing, sequence, duration patterns).",
      "domain": [
        "Migration",
        "Relocation",
        "Travel"
      ],
      "range": [
        "TemporalDetail"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to represent complex temporal information for movement events—such as recurring migrations, staggered moves, or overlapping durations.",
        "constraints": "Should not duplicate basic event dates/durations; use only for cases requiring supplementary temporal analysis."
      }
    },
    {
      "name": "hasSpatialDetail",
      "description": "Links a migration, relocation, or travel event to its associated spatial details, including mapped routes, regions traversed, or spatial patterns.",
      "domain": [
        "Migration",
        "Relocation",
        "Travel"
      ],
      "range": [
        "SpatialDetail"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to associate spatial annotations, details, or route information with a mobility event, supporting richer geospatial queries or representations.",
        "constraints": "Use in addition to, not in place of, occurredAtLocation or mapsGeographically; appropriate for complex mobility involving multiple locations or nuanced spatial patterns."
      }
    },
    {
      "name": "isInMulticulturalContext",
      "description": "Links a person or a life event to a multicultural context that shapes or is reflected in their biography.",
      "domain": [
        "Person",
        "LifeEvent"
      ],
      "range": [
        "MulticulturalContext"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to indicate the relevance of multicultural experience, participation, or identity for a given person or event.",
        "constraints": "Multiple such contexts may be linked if distinct multicultural experiences are present."
      }
    },
    {
      "name": "hasCurationAction",
      "description": "Associates a record element or life history record with the specific curation action(s) performed on it.",
      "domain": [
        "RecordElement"
      ],
      "range": [
        "CurationAction"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link each record element to the actions that authored, curated, or modified it.",
        "constraints": "Multiple curation actions may apply to a record element; each action should reference its performer and timestamp."
      }
    },
    {
      "name": "performedBy",
      "description": "Identifies the agent, such as a person or organization, who performed a curation action on a record.",
      "domain": [
        "CurationAction"
      ],
      "range": [
        "Person",
        "Organization"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to record the specific person or organization responsible for a curation action (authorship, curation, modification) on a record.",
        "constraints": "Exactly one agent per curation action."
      }
    },
    {
      "name": "providedSelfNarrative",
      "description": "Indicates that a person has provided a self-narrative or autobiographical account capturing their perspective on key events, roles, or transitions.",
      "domain": [
        "Person"
      ],
      "range": [
        "SelfNarrative"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to associate an individual with self-authored narratives about their own experiences.",
        "constraints": "Multiple self-narratives are allowed, such as about different periods or themes in a person’s life."
      }
    },
    {
      "name": "reflectsOnIdentity",
      "description": "Denotes that an affiliation, relationship, or narrative reflects or impacts a person’s identity, opportunities, or life outcomes.",
      "domain": [
        "AffiliationRole",
        "FamilyRelationship",
        "SocialRelationship",
        "LifeNarrative",
        "SelfNarrative"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to capture cases where the nature or structure of affiliations/relationships is explicitly said to influence or reflect a person’s sense of self, opportunities, or outcomes.",
        "constraints": "Should only be used when a relation, role, or narrative has documented or asserted impact on identity or opportunities."
      }
    },
    {
      "name": "affectsLifeOutcome",
      "description": "Indicates that an affiliation or relationship has a documented effect on the opportunities, transitions, or outcomes in a person's life.",
      "domain": [
        "AffiliationRole",
        "FamilyRelationship",
        "SocialRelationship"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use when affiliations or relationships are analytically or narratively linked to changes or opportunities in a person's life course (e.g., access to educational opportunities, career advancement).",
        "constraints": "Should not be used for generic relationships unless their impact is clearly established or asserted."
      }
    },
    {
      "name": "hasLifePhase",
      "description": "Associates a person or a timeline with a distinct life phase experienced over their biography.",
      "domain": [
        "Person",
        "Timeline"
      ],
      "range": [
        "LifePhase"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to indicate the presence and delineation of major life phases within a person’s life history.",
        "constraints": "A person or timeline may have multiple life phases, some of which may overlap."
      }
    },
    {
      "name": "hasTransition",
      "description": "Links a person, timeline, or life phase to a specific transition event marking a significant change in life status, arrangement, or phase.",
      "domain": [
        "Person",
        "Timeline",
        "LifePhase"
      ],
      "range": [
        "Transition"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to record significant passages or turning points between phases, arrangements, or statuses in a life course.",
        "constraints": "Multiple transitions can occur in the life of an individual; transitions should be explicitly delimited by relevant events or context."
      }
    },
    {
      "name": "isPrecededByPhase",
      "description": "Denotes that one life phase follows directly after another on a person’s timeline.",
      "domain": [
        "LifePhase"
      ],
      "range": [
        "LifePhase"
      ],
      "characteristics": [
        "asymmetric",
        "irreflexive",
        "transitive"
      ],
      "usage_guideline": {
        "description": "Use to define the sequential order of life phases in a chronology.",
        "constraints": "Only use where the transition from one phase to the next is defined; do not create loops or circularities."
      }
    },
    {
      "name": "visualizedOnMap",
      "description": "Indicates that a life phase, life event, or transition is represented or visualized in a geospatial mapping context.",
      "domain": [
        "LifePhase",
        "LifeEvent",
        "Transition"
      ],
      "range": [
        "Location"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use when associating a life phase, event, or transition with its depiction or representation in geographic form (e.g., on a migration or event map).",
        "constraints": "Should be used for map-based visualization or geospatial analysis scenarios."
      }
    },
    {
      "name": "hasGroupParticipation",
      "description": "Links a person to a GroupParticipation episode, representing their involvement in volunteer, advocacy, or cultural groups.",
      "domain": [
        "Person"
      ],
      "range": [
        "GroupParticipation"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Associate each person with episodes of engagement in advocacy, cultural, or volunteer groups; allows documentation of periods, roles, and the evolution of participation.",
        "constraints": "Multiple participations per person allowed; use when involvement is distinctive enough to record."
      }
    },
    {
      "name": "participatedInGroup",
      "description": "Indicates the group (e.g., volunteer, advocacy, or cultural group) with which a given GroupParticipation episode is associated.",
      "domain": [
        "GroupParticipation"
      ],
      "range": [
        "CommunityGroup"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Specify the particular group or association connected to each participation episode.",
        "constraints": "One group per participation period; model multiple GroupParticipation instances for repeated or multi-group involvement."
      }
    },
    {
      "name": "heldRoleInGroup",
      "description": "Identifies the specific role that a person held during their participation in a group, as represented in a GroupParticipation episode.",
      "domain": [
        "GroupParticipation"
      ],
      "range": [
        "RoleInGroup"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to indicate the person's particular responsibility or function for each period of involvement.",
        "constraints": "Only one primary role per episode; use additional GroupParticipation if roles changed substantially."
      }
    },
    {
      "name": "hasParticipationImplication",
      "description": "Links a GroupParticipation or LegalEvent to its implication(s), namely changes, outcomes, or effects resulting from the event or participation.",
      "domain": [
        "GroupParticipation",
        "LegalEvent"
      ],
      "range": [
        "Implication"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to record the effects, changes, or outcomes of relevant legal, civic, or group participation events.",
        "constraints": "Multiple implications may be linked if more than one outcome is documented."
      }
    },
    {
      "name": "hasPersonalNarrative",
      "description": "Associates a person with one or more PersonalNarrative accounts (oral histories, testimonies, etc.) documenting their life experience.",
      "domain": [
        "Person"
      ],
      "range": [
        "PersonalNarrative"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Link each person to their available personal narratives, which may be multilingual or reflect various cultural frameworks.",
        "constraints": "Multiple narratives per person allowed; each narrative instance should be unique."
      }
    },
    {
      "name": "hasNarrativeTranslation",
      "description": "Relates a PersonalNarrative to its available translations/adaptations in other languages or cultural frameworks.",
      "domain": [
        "PersonalNarrative"
      ],
      "range": [
        "NarrativeTranslation"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to reference all alternate language or culturally adapted versions of a narrative.",
        "constraints": "Multiple translations per narrative allowed; each translation should specify language and relevant adaptation."
      }
    },
    {
      "name": "attachsArtifactToLifeHistory",
      "description": "Links an attachment (e.g., as specified record, document, or digital artifact) to the person’s overarching life history or biography, indicating explicit inclusion or support.",
      "domain": [
        "Attachment"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use this property to indicate that an artifact, source, or document is attached to the life history of a specific person as supporting evidence or narrative supplement.",
        "constraints": "Link each Attachment to exactly one Person's life history for explicit, non-ambiguous association."
      }
    },
    {
      "name": "attachesArtifact",
      "description": "Relates an attachment to the actual digital artifact (e.g., photo, video, audio, scanned document) or source being attached.",
      "domain": [
        "Attachment"
      ],
      "range": [
        "DigitalArtifact"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to specify which digital artifact, multimedia item, or record is included via the Attachment for a person’s life history.",
        "constraints": "Each Attachment may reference one or more DigitalArtifact instances; use distinct Attachment instances if needed for diverse artifact types."
      }
    },
    {
      "name": "isAttachmentOf",
      "description": "Relates a digital artifact, source, or annotation to its role as an attachment within a person's life history.",
      "domain": [
        "DigitalArtifact"
      ],
      "range": [
        "Attachment"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to specify the inverse relation: that a given artifact is present as an attachment for a life history or timeline record.",
        "constraints": "Should be used for navigation/querying from artifact to its usage context."
      }
    },
    {
      "name": "verifiesLifeHistoryInformation",
      "description": "Indicates that a source (such as official record, document, or institutional record) is used to verify specific content or facts in a person’s life history.",
      "domain": [
        "Source"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to encode evidentiary or verification relationships between a source and the aspects of a person's life history it confirms or attests. Supports traceability and reliability modeling.",
        "constraints": "Sources may verify all or part of a person’s life history; specify the scope in annotation if partial."
      }
    },
    {
      "name": "hasAnnotationForPeriodOrEvent",
      "description": "Links an annotation, qualitative code, or commentary to a particular period or event in a person's life history, enabling fine-grained qualitative enrichment.",
      "domain": [
        "Annotation"
      ],
      "range": [
        "LifeEvent"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use for associating interpretive notes or qualitative codes to particular life events or time-bounded periods (not just the entire biography). May be used in coding/analysis workflows.",
        "constraints": "Each Annotation should specify the directly contextualized LifeEvent(s) or defined period; multiple annotations per event/period are permitted."
      }
    },
    {
      "name": "hasLanguageProficiency",
      "description": "Associates a person with their specific proficiency record in a given language.",
      "domain": [
        "Person"
      ],
      "range": [
        "LanguageProficiency"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to list all language proficiencies a person holds; link to specific Language instances and context.",
        "constraints": "Multiple language proficiencies may be recorded per person."
      }
    },
    {
      "name": "inLanguage",
      "description": "Indicates the language to which a language proficiency record applies.",
      "domain": [
        "LanguageProficiency"
      ],
      "range": [
        "Language"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to associate a language proficiency with its specific natural language.",
        "constraints": "Each LanguageProficiency instance should reference exactly one Language."
      }
    },
    {
      "name": "hasReasonForInterruption",
      "description": "Links a life event representing an interruption (e.g., career break, sabbatical, unemployment) to the reason or explanation for that period.",
      "domain": [
        "CareerInterruption",
        "SabbaticalPeriod",
        "UnemploymentPeriod"
      ],
      "range": [
        "ReasonForInterruption"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to explicitly state why an interruption or break in career/employment occurred.",
        "constraints": "One reason per interruption instance; use controlled vocabularies if possible."
      }
    },
    {
      "name": "hasReligiousAffiliation",
      "description": "Associates a Person with their religious affiliation during a specific period of their life.",
      "domain": [
        "Person"
      ],
      "range": [
        "ReligiousAffiliation"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to capture periods or contexts in which a person identified with, participated in, or was recognized as belonging to a particular religion or denomination.",
        "constraints": "A person may have multiple ReligiousAffiliation instances over their life, each with distinct time periods or contexts."
      }
    },
    {
      "name": "hasLanguageUseContext",
      "description": "Connects a LanguageProficiency record to the context(s) in which a person uses a language.",
      "domain": [
        "LanguageProficiency"
      ],
      "range": [
        "LanguageUseContext"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to specify the setting or situation (e.g., home, work, community) in which a language is used by the person.",
        "constraints": "Multiple LanguageUseContext instances may apply to one LanguageProficiency."
      }
    },
    {
      "name": "hasCareerMilestoneType",
      "description": "Specifies the type of career milestone for a CareerMilestone instance.",
      "domain": [
        "CareerMilestone"
      ],
      "range": [
        "CareerMilestoneType"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to describe distinctly whether a career milestone is an employment, recognition, promotion, demotion, or unemployment.",
        "constraints": "Assign exactly one type per CareerMilestone; extend type list with care to avoid overlap."
      }
    },
    {
      "name": "hasPreferredName",
      "description": "Associates a person with their preferred name, distinct from legal or birth names.",
      "domain": [
        "Person"
      ],
      "range": [
        "PreferredName"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to link an individual to their current or historically declared preferred name. One value per period is typical; use multiple instances if preference changed over time.",
        "constraints": "Should only be used when the preferred name is distinct and explicitly designated."
      }
    },
    {
      "name": "hasAlias",
      "description": "Links a person to one or more aliases or alternative names they have used.",
      "domain": [
        "Person"
      ],
      "range": [
        "Alias"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to capture alternative, informal, or community names used by an individual. Can be repeated for multiple aliases; useful for mapping digital identities, stage names, or nicknames.",
        "constraints": "Do not use for legal names or preferred names unless used separately as aliases."
      }
    },
    {
      "name": "hasMultimediaArtifact",
      "description": "Links a person or a life event to a specific multimedia artifact, such as a photograph, video, or audio file, that is relevant to their life history.",
      "domain": [
        "Person",
        "LifeEvent"
      ],
      "range": [
        "MultimediaArtifact"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to associate people or events directly with evidentiary or illustrative multimedia materials for enrichment, validation, or illustration.",
        "constraints": "May associate multiple artifacts per person or event; does not replace source or attachment classes."
      }
    },
    {
      "name": "hasLicense",
      "description": "Associates a person with a license, legal authorization, or formal permit they possess or have possessed.",
      "domain": [
        "Person"
      ],
      "range": [
        "License"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link individuals to licenses or legal authorizations they have held. Multiple licenses may be associated with a single person if applicable.",
        "constraints": "Does not duplicate official identifiers; only use for legal permissions or credentials."
      }
    },
    {
      "name": "hasAncestryDetail",
      "description": "Associates a person with documented details of their ancestry or genealogical background.",
      "domain": [
        "Person"
      ],
      "range": [
        "AncestryDetail"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link a person with structured or narrative details about their familial origins or known lineage.",
        "constraints": "Multiple ancestry details can be provided for different aspects of lineage, as supported by documentation."
      }
    },
    {
      "name": "hasIntergenerationalConnection",
      "description": "Indicates explicit intergenerational links or patterns relevant to a person’s ancestry, family relationship, or historical lineage.",
      "domain": [
        "Person"
      ],
      "range": [
        "IntergenerationalConnection"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to model cross-generational relationships of genealogical or social significance, such as multi-generational influence or patterns.",
        "constraints": "Should specify the generational span or type of connection."
      }
    },
    {
      "name": "heldEmploymentPeriod",
      "description": "Links a person to a specific employment period or job episode, recording the period, position, employer, and location.",
      "domain": [
        "Person"
      ],
      "range": [
        "EmploymentPeriod"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to enumerate each job, position, or professional role a person has held as part of their occupational history.",
        "constraints": "Multiple employment periods per person are permitted; each distinct job/role should be a separate instance."
      }
    },
    {
      "name": "hasGeographicContext",
      "description": "Associates a life event, employment period, or professional role with relevant geographic context or environment.",
      "domain": [
        "LifeEvent",
        "EmploymentPeriod"
      ],
      "range": [
        "GeographicContext"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to give context for events or jobs where the geographic region or setting is analytically or narratively significant.",
        "constraints": "Use when the place or geographic circumstance adds interpretive value distinct from specific occurredAtLocation."
      }
    },
    {
      "name": "isContextualizedByCulturalContext",
      "description": "Indicates that a life event, employment period, or significant biography segment is interpreted or understood within a specific cultural, religious, or linguistic context.",
      "domain": [
        "LifeEvent",
        "EmploymentPeriod"
      ],
      "range": [
        "CulturalContext"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use when events or roles must be contextualized within the person’s cultural/religious/linguistic identity for accurate interpretation.",
        "constraints": "Use only for cases where the contextual factor is explicitly relevant to event or trajectory analysis."
      }
    },
    {
      "name": "hasNameType",
      "description": "Indicates the category or type of a name used by a person within a NameHistory record, such as legal name, preferred name, or alias.",
      "domain": [
        "NameHistory"
      ],
      "range": [
        "NameType"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Assign a single NameType category to each NameHistory record to enable distinctions among legal, preferred, alias, and other name usages.",
        "constraints": "Exactly one NameType per NameHistory instance. Controlled values should be maintained for interoperability."
      }
    },
    {
      "name": "hasAward",
      "description": "Indicates that a person has received a specific formal award or honor.",
      "domain": [
        "Person"
      ],
      "range": [
        "Award"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Apply to link individuals to formal awards or honors they have received, representing institutional or organizational recognition.",
        "constraints": "May be repeated for multiple awards; should only link to formal, documented awards."
      }
    },
    {
      "name": "hasInformalAchievement",
      "description": "Denotes a person's receipt or accomplishment of a notable informal recognition or achievement.",
      "domain": [
        "Person"
      ],
      "range": [
        "InformalAchievement"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Link individuals to informal but relevant achievements or recognitions in their biography.",
        "constraints": "Multiple achievements possible per person; use only for significant, contextually meaningful recognitions."
      }
    },
    {
      "name": "awardedBy",
      "description": "Identifies the awarding body, organization, or authority responsible for granting a particular award to a person.",
      "domain": [
        "Award"
      ],
      "range": [
        "AwardingBody"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to tie each award instance to the specific entity that conferred it.",
        "constraints": "Each award should reference a single awarding body; use additional properties if joint awarding occurs."
      }
    },
    {
      "name": "annotationAttachedToElement",
      "description": "Relates an AnnotationAttachment to the structured biographical data element (e.g., life event, social relationship, affiliation, record segment) it supplements or comments on.",
      "domain": [
        "AnnotationAttachment"
      ],
      "range": [
        "LifeEvent",
        "SocialRelationship",
        "FamilyRelationship",
        "AffiliationRole",
        "RecordElement"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to specify the target of an annotation or commentary attachment. Enables rich semantic and interpretive integration with structured data.",
        "constraints": "Only one primary target per attachment; use additional instances for multi-target attachments."
      }
    },
    {
      "name": "heldRoleInMembership",
      "description": "Indicates the specific formal or informal role a person held during a group or network membership episode.",
      "domain": [
        "GroupMembership"
      ],
      "range": [
        "AffiliationRole"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to specify the capacity in which a person participated (e.g., member, moderator, leader) during a distinct membership period.",
        "constraints": "One primary role per GroupMembership instance; specify multiple memberships if the role changed over time."
      }
    },
    {
      "name": "hasMembershipStatusInMembership",
      "description": "Denotes the status of a person's membership within a group or network during a specific membership episode (e.g., active, honorary, former).",
      "domain": [
        "GroupMembership"
      ],
      "range": [
        "MembershipStatus"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Assign to GroupMembership to distinguish between active, former, or other status per episode.",
        "constraints": "Controlled vocabulary for status terms preferred; one status per GroupMembership instance."
      }
    },
    {
      "name": "documentsGroupMembership",
      "description": "Links a Source or Testimony to evidence or documentation of a person's membership or participation in a group or network.",
      "domain": [
        "Source",
        "Testimony"
      ],
      "range": [
        "GroupMembership"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to reference the documentary or testimonial evidence supporting or attesting to group or network membership.",
        "constraints": "One Source/Testimony may document multiple GroupMemberships, and each GroupMembership may be documented by multiple sources."
      }
    },
    {
      "name": "isMemberOfGroupMembership",
      "description": "Links a Person to a specific GroupMembership episode in which they participated.",
      "domain": [
        "Person"
      ],
      "range": [
        "GroupMembership"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use in preference to generic membership properties for cases requiring explicit modeling of group participation histories with role, status, and time.",
        "constraints": "Use one instance per group membership period per person; do not use to link to organizations or community groups directly unless the GroupMembership context is explicitly modeled."
      }
    },
    {
      "name": "isMembershipInGroup",
      "description": "Associates a GroupMembership episode with the Organization, CommunityGroup, or InformalNetwork to which the membership applies.",
      "domain": [
        "GroupMembership"
      ],
      "range": [
        "Organization",
        "CommunityGroup",
        "InformalNetwork"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Specify the group, organization, or network associated with the membership record.",
        "constraints": "Must only reference one group per GroupMembership instance; select the most specific type available."
      }
    },
    {
      "name": "hasLineageRecord",
      "description": "Associates a person with a specific lineage record capturing ancestral relationships or lines of descent.",
      "domain": [
        "Person"
      ],
      "range": [
        "LineageRecord"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to link individuals to their documented genealogical or ancestral lineages.",
        "constraints": "A person may have multiple lineage records if documented through different descent lines or community ties."
      }
    },
    {
      "name": "isAncestorInLineage",
      "description": "Identifies a person as an ancestor within a given lineage record.",
      "domain": [
        "LineageRecord"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to designate which person(s) are considered ancestors within a particular lineage record.",
        "constraints": "Multiple ancestors may be linked to a single LineageRecord, denoting lineage origin or important generational links."
      }
    },
    {
      "name": "isDescendantInLineage",
      "description": "Indicates a person as a descendant within a given lineage record.",
      "domain": [
        "LineageRecord"
      ],
      "range": [
        "Person"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to specify which person(s) are identified as descendants in a particular documented lineage.",
        "constraints": "Multiple descendants may be linked to one LineageRecord when modeling extended lineages or branching genealogies."
      }
    },
    {
      "name": "hasProfessionalRecognition",
      "description": "Associates a person with a professional recognition event or milestone they have received.",
      "domain": [
        "Person"
      ],
      "range": [
        "ProfessionalRecognition"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Link a person to all formal and informal professional recognitions received during their career.",
        "constraints": "Multiple recognitions per person may be recorded."
      }
    },
    {
      "name": "hasCertificationAchievement",
      "description": "Links a person to a professional certification achievement that they have obtained.",
      "domain": [
        "Person"
      ],
      "range": [
        "CertificationAchievement"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use for connecting individuals to completed, valid career-related certifications as part of their professional record.",
        "constraints": "Multiple certifications possible per person."
      }
    },
    {
      "name": "hasInformalProfessionalAchievement",
      "description": "Associates a person with a notable informal achievement within their professional or career context.",
      "domain": [
        "Person"
      ],
      "range": [
        "InformalProfessionalAchievement"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Link to informal, contextually significant career achievements not covered by awards or certifications.",
        "constraints": "Multiple instances can be recorded per individual."
      }
    },
    {
      "name": "hasChronologicalSequence",
      "description": "Links a Timeline, LifeEvent, or PersonalNarrative to its explicit chronological sequence, enabling reasoning over temporal order.",
      "domain": [
        "Timeline",
        "LifeEvent",
        "PersonalNarrative"
      ],
      "range": [
        "ChronologicalSequence"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to associate entities with their explicit chronological order or sequence. Especially relevant when sequencing spans narrative and event datasets.",
        "constraints": "A single entity may belong to multiple sequences, but each sequence should have a clearly defined order."
      }
    },
    {
      "name": "hasGeographicMapping",
      "description": "Connects a Timeline, LifeEvent, or NarrativeEpisode with its associated GeographicMapping, supporting mapped visualizations and spatial queries.",
      "domain": [
        "Timeline",
        "LifeEvent",
        "NarrativeEpisode"
      ],
      "range": [
        "GeographicMapping"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to enable spatial representation and analysis of event or narrative elements when mapped to locations or regions.",
        "constraints": "Each mapping should reference all relevant events or narrative episodes for accurate visualization."
      }
    },
    {
      "name": "hasNarrativeEpisode",
      "description": "Associates a PersonalNarrative, Testimony, or OralHistory with its constituent NarrativeEpisodes.",
      "domain": [
        "PersonalNarrative",
        "Testimony"
      ],
      "range": [
        "NarrativeEpisode"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to explicitly subdivide narrative accounts into distinct episodes for fine-grained mapping to events or timelines.",
        "constraints": "A narrative may comprise multiple episodes; map each episode to relevant LifeEvent or period where applicable."
      }
    },
    {
      "name": "isNonTraditionalPathwayOf",
      "description": "Indicates that a NonTraditionalPathway is associated with a given EducationEpisode, CareerInterruption, or Timeline, documenting deviations from normative progression.",
      "domain": [
        "NonTraditionalPathway"
      ],
      "range": [
        "EducationEpisode",
        "CareerInterruption",
        "Timeline"
      ],
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to annotate or link educational/career episodes that are categorized as non-standard, interrupted, or non-linear.",
        "constraints": "Each NonTraditionalPathway instance should reference the affected period or event."
      }
    },
    {
      "name": "hasSpecialization",
      "description": "Links an EducationEpisode or Program to the specialization that was pursued during that period.",
      "domain": [
        "EducationEpisode",
        "Program"
      ],
      "range": [
        "Specialization"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to specify the detailed academic or professional specialization associated with a formal education episode or structured program.",
        "constraints": "Each EducationEpisode or Program instance should have at most one primary specialization; use multiple relationships only if the context supports multiple concurrent specializations."
      }
    },
    {
      "name": "birthPlace",
      "description": "Specifies the location at which a person was born.",
      "domain": [
        "Person"
      ],
      "range": [
        "Location"
      ],
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use this property to identify the specific place of birth for an individual.",
        "constraints": "Each person should have at most one birth place recorded; link to an existing Location instance."
      }
    }
  ],
  "data_properties": [
    {
      "name": "occurredOnDate",
      "description": "Specifies the calendar date when a life event occurred.",
      "domain": [
        "LifeEvent"
      ],
      "range": "xsd:date",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to specify the date of a life event.",
        "constraints": "Each life event should have exactly one associated date."
      }
    },
    {
      "name": "relationshipType",
      "description": "Specifies the concrete nature of a family relationship (e.g., parent, child, sibling, spouse, step, adoptive, chosen family, extended family, etc.).",
      "domain": [
        "FamilyRelationship"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Identify the kind of family relationship, using controlled vocabulary if possible.",
        "constraints": "Each FamilyRelationship instance should have one specific type."
      }
    },
    {
      "name": "hasAgeAtEvent",
      "description": "Specifies the age of the person at the time a particular life event occurred.",
      "domain": [
        "LifeEvent"
      ],
      "range": "xsd:integer",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Specify the age (in years) at which the person experienced the event.",
        "constraints": "Use integer values; applicable when age at event is of interest or available."
      }
    },
    {
      "name": "hasUncertaintyNote",
      "description": "Provides a textual explanation or annotation about the uncertainty, ambiguity, or incomplete nature of a particular life event.",
      "domain": [
        "LifeEvent"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Attach a brief summary explaining why a LifeEvent’s data are uncertain, such as missing dates, ambiguous involvement, or alternative interpretations.",
        "constraints": "Intended for free-text notes; should be used where uncertainty is relevant."
      }
    },
    {
      "name": "uncertaintyLevel",
      "description": "Represents the degree or severity of uncertainty associated with a LifeEvent, typically encoded as a controlled value (e.g., ‘high’, ‘moderate’, ‘low’).",
      "domain": [
        "LifeEvent"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Specify the uncertainty level for a LifeEvent instance, ideally using a standardized set of terms.",
        "constraints": "Use controlled vocabulary and ensure consistency across events; optional where information is certain."
      }
    },
    {
      "name": "hasPeriodDuration",
      "description": "Specifies the duration in days, months, or years that a life event or period lasted.",
      "domain": [
        "LifeEvent"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use ISO 8601 duration format (e.g., 'P3Y' for three years) when possible. Useful for education, career, or migration episodes with known start and end.",
        "constraints": "Duration should be recorded where both start and end are known or can be reasonably estimated."
      }
    },
    {
      "name": "hasEventStartDate",
      "description": "Indicates the calendar date on which a life event began, when the event has duration.",
      "domain": [
        "LifeEvent"
      ],
      "range": "xsd:date",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use for events or periods with both start and end dates (e.g., multi-year employment).",
        "constraints": "Must not be used if event is instantaneous or only the end date is known."
      }
    },
    {
      "name": "hasEventEndDate",
      "description": "Indicates the calendar date on which a life event ended, where applicable.",
      "domain": [
        "LifeEvent"
      ],
      "range": "xsd:date",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use for delimiting the conclusion of an event with a known end point (e.g., end of education, end of migration period).",
        "constraints": "Not required for instantaneous events or those with uncertain end."
      }
    },
    {
      "name": "hasSocioEconomicStatus",
      "description": "Describes a person's socio-economic status during a particular life period or event, such as class, occupation, or other stratification.",
      "domain": [
        "Person"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use for textual, controlled, or coded descriptions of socio-economic status at a given time. May be applied separately to multiple periods using event-related context.",
        "constraints": "Choose a consistent taxonomy or encoding scheme if available (e.g., 'working class', 'middle class', 'upper class')."
      }
    },
    {
      "name": "hasCulturalBackground",
      "description": "Specifies a person's cultural, linguistic, national, or ethnic background relevant to social identity and biography.",
      "domain": [
        "Person"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Capture salient dimensions of a person's cultural heritage or background, such as ethnicity, nationality, or linguistic heritage.",
        "constraints": "Use culturally respectful terminology and, where necessary, link to controlled vocabularies."
      }
    },
    {
      "name": "impactedLifeEvent",
      "description": "Records the impact or influence that socio-economic or cultural background had on particular major life events or transitions.",
      "domain": [
        "LifeEvent"
      ],
      "range": "xsd:string",
      "characteristics": [],
      "usage_guideline": {
        "description": "Use to annotate events with narrative or analytical comments about the role background factors played in event outcomes.",
        "constraints": "Free-text or controlled vocab; should be used where explicit links between background and event exist."
      }
    },
    {
      "name": "hasSourceProvenance",
      "description": "Describes the custodial or transmission history (provenance) of a source, clarifying where it originated and how it has been preserved.",
      "domain": [
        "Source"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use for summarizing or referencing provenance documentation (e.g., archive reference, previous owners, acquisition trail).",
        "constraints": "Value should be concise; may use archival/historical conventions for citing provenance."
      }
    },
    {
      "name": "hasSourceReliability",
      "description": "Represents an assessment of a source's reliability/credibility for documenting a life event or claim.",
      "domain": [
        "Source"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Indicate reliability as free text or using a chosen controlled vocabulary (e.g., 'high', 'moderate', 'low').",
        "constraints": "Use consistent evaluation criteria where possible."
      }
    },
    {
      "name": "relationshipTypeInSocialRelationship",
      "description": "Specifies the kind of social or professional relationship (e.g., mentor, colleague, friend) that links persons in a SocialRelationship.",
      "domain": [
        "SocialRelationship"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Describe the nature of the relationship using clear, controlled, or free text terms.",
        "constraints": "One descriptor per SocialRelationship instance. Use controlled vocabularies if possible and contextually appropriate."
      }
    },
    {
      "name": "hasRelationshipPeriod",
      "description": "Associates a SocialRelationship with the time period during which it was active.",
      "domain": [
        "SocialRelationship"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use ISO 8601 duration or simple date ranges to denote the period of validity of a relationship.",
        "constraints": "Applicable to relationships that are time-bound; omit if duration is unknown."
      }
    },
    {
      "name": "hasModificationDate",
      "description": "Specifies the date and time when a document or source was last modified or updated.",
      "domain": [
        "Document",
        "Source"
      ],
      "range": "xsd:dateTime",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record precise modification timestamps where available, using standardized date-time formatting.",
        "constraints": "Should have at most one value per instance; use only if the modification date is known and tracked."
      }
    },
    {
      "name": "hasAuthenticityAssessment",
      "description": "Represents a textual or categorized evaluation of a source or document's authenticity.",
      "domain": [
        "Source",
        "Document"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record qualitative assessments, confidence levels, or notes about a source's or document's authenticity.",
        "constraints": "Use controlled vocabulary or documented criteria where possible. Each instance should have one authenticity assessment if such information is available."
      }
    },
    {
      "name": "hasSourceLanguage",
      "description": "Specifies the language(s) in which a document, testimony, or source is recorded.",
      "domain": [
        "Source",
        "Document",
        "Testimony"
      ],
      "range": "xsd:string",
      "characteristics": [],
      "usage_guideline": {
        "description": "Indicate the primary and any secondary languages of the resource, using language codes or names.",
        "constraints": "Can record multiple languages if the resource is multilingual. Use ISO codes when possible."
      }
    },
    {
      "name": "hasSourceFormat",
      "description": "Describes the physical or digital format of a document, testimony, or source (e.g., manuscript, audio, video, PDF, paper).",
      "domain": [
        "Source",
        "Document",
        "Testimony"
      ],
      "range": "xsd:string",
      "characteristics": [],
      "usage_guideline": {
        "description": "Specify the storage, encoding, or carrier medium relevant for accessing or preserving the resource.",
        "constraints": "Use standardized vocabulary (e.g., MIME types, format names) where possible. Multiple formats may be specified if appropriate."
      }
    },
    {
      "name": "hasConsentRestriction",
      "description": "Describes specific restrictions, limitations, or conditions pertaining to the use of life history data under a given consent.",
      "domain": [
        "Consent"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Specify restrictions such as embargoes, allowed usage, anonymization requirements, or recipient categories.",
        "constraints": "One restriction statement per consent; further details can be provided as needed."
      }
    },
    {
      "name": "hasConsentAccessControl",
      "description": "Specifies access control policies, required permissions, or other access-related constraints for records under a specific consent.",
      "domain": [
        "Consent"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Indicate who may access the data, under what circumstances, or with which credentials.",
        "constraints": "Can codify policies as text or reference access control models."
      }
    },
    {
      "name": "hasPolicyDescription",
      "description": "Provides a textual description or summary of the content, terms, or scope of an access control policy.",
      "domain": [
        "AccessControlPolicy"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to provide human-readable documentation of access rights, constraints, or special conditions within a policy.",
        "constraints": "One summary per policy instance; should reflect the substance of the access rules."
      }
    },
    {
      "name": "providesInsight",
      "description": "Indicates the interpretive or analytical insight that a given annotation, commentary, or tag supplies about a life event, narrative, or data entry.",
      "domain": [
        "Annotation"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to summarize or record the main insight, interpretive theme, or added value delivered by the annotation.",
        "constraints": "Use a concise summary (controlled vocabulary preferred if available); one per annotation."
      }
    },
    {
      "name": "causedByFactor",
      "description": "Specifies the major factor, circumstance, or event that contributed to a change in socio-economic status.",
      "domain": [
        "SocioEconomicStatusChange"
      ],
      "range": "xsd:string",
      "characteristics": [],
      "usage_guideline": {
        "description": "Describe significant contributing factors (e.g., educational attainment, job loss, inheritance, health crisis).",
        "constraints": "Use concise, controlled terms where possible; multiple factors can be represented by repeating property."
      }
    },
    {
      "name": "associatedWithTimePeriod",
      "description": "Indicates the time period during which a career milestone, legal event, or other life event occurred or was relevant.",
      "domain": [
        "CareerMilestone",
        "LegalEvent"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use ISO 8601 date intervals or human-readable period summaries as appropriate; supports temporal queries over milestones and legal events.",
        "constraints": "One association per event/milestone; must specify as precisely as possible."
      }
    },
    {
      "name": "lastModifiedOn",
      "description": "Indicates the date and time when a record element was last modified.",
      "domain": [
        "RecordElement"
      ],
      "range": "xsd:dateTime",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record the most recent modification timestamp for provenance and data management purposes.",
        "constraints": "One modification date-time per element; should reflect the latest change."
      }
    },
    {
      "name": "contributedByFactor",
      "description": "Specifies a factor or cause contributing to the change of a household composition or living arrangement.",
      "domain": [
        "HouseholdComposition",
        "LivingArrangement"
      ],
      "range": "xsd:string",
      "characteristics": [],
      "usage_guideline": {
        "description": "Identify events, circumstances, or factors (e.g., marriage, birth, migration, financial change) that caused the household or living arrangement to change.",
        "constraints": "Multiple factors can be listed as needed; use controlled terms where possible."
      }
    },
    {
      "name": "highlightsTheme",
      "description": "Specifies the particular theme, concept, or analytical lens that is emphasized or highlighted by an annotation, qualitative tag, or commentary.",
      "domain": [
        "Annotation",
        "QualitativeTag"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to capture the main topical, thematic, or conceptual focus made explicit by the annotation or tag (e.g., 'migration', 'resilience', 'access to education', 'identity').",
        "constraints": "Prefer standardized vocabularies where available. Each instance should highlight only one theme; use multiple properties for multiple themes if needed."
      }
    },
    {
      "name": "hasOfficialIdentifierValue",
      "description": "Specifies the data value (e.g., number, code, alphanumeric string) of the official identifier assigned to a person.",
      "domain": [
        "OfficialIdentifier"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record the exact identifier value as issued on the official document.",
        "constraints": "One official value per identifier instance; sensitive and may require privacy/protection handling."
      }
    },
    {
      "name": "hasIdentifierType",
      "description": "Indicates the type or category of the official identifier (e.g., 'national ID', 'passport', 'driver’s license').",
      "domain": [
        "OfficialIdentifier"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Define the nature of the identifier using standard type designators.",
        "constraints": "Controlled vocabulary should be used for identifier type terms."
      }
    },
    {
      "name": "hasDemographicAttributeValue",
      "description": "Denotes the value or classification (e.g., 'female', 'Hispanic', 'French') of a demographic attribute.",
      "domain": [
        "DemographicAttribute"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use clear, controlled vocabulary or standardized value terms reflecting the demographic property type.",
        "constraints": "One value per attribute instance."
      }
    },
    {
      "name": "hasDemographicAttributeType",
      "description": "Specifies the type of demographic attribute, such as gender, ethnicity, nationality, etc.",
      "domain": [
        "DemographicAttribute"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Categorize the demographic attribute using defined attribute types.",
        "constraints": "Attribute type should be selected from a controlled list (e.g., 'gender', 'ethnicity')."
      }
    },
    {
      "name": "hasStatusDescription",
      "description": "Provides a textual description or controlled value reflecting membership status (e.g., 'active', 'honorary', 'resigned').",
      "domain": [
        "MembershipStatus"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Assign a concise, standardized status description using predefined terms.",
        "constraints": "Only one description per MembershipStatus instance; controlled list strongly preferred."
      }
    },
    {
      "name": "accessedOnDate",
      "description": "The date and time on which access to an individual's data occurred.",
      "domain": [
        "DataAccessRecord"
      ],
      "range": "xsd:dateTime",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record precise timestamp of each data access for auditing purposes.",
        "constraints": "One date-time per DataAccessRecord."
      }
    },
    {
      "name": "accessPurpose",
      "description": "The stated purpose or rationale for which an individual's data was accessed, as recorded in a DataAccessRecord.",
      "domain": [
        "DataAccessRecord"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to record the official or declared reason behind data access (e.g., research, administration).",
        "constraints": "Textual, concise reason; one per DataAccessRecord."
      }
    },
    {
      "name": "hasNameValue",
      "description": "Specifies the name value (e.g., full legal name, alias, pseudonym) that is part of a person's NameHistory record.",
      "domain": [
        "NameHistory"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record the exact name used during the relevant period.",
        "constraints": "One name value per NameHistory record."
      }
    },
    {
      "name": "namePeriod",
      "description": "Defines the date or time period during which a specific name was used by an individual.",
      "domain": [
        "NameHistory"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Document as a date range, start-end or narrative period.",
        "constraints": "Apply ISO 8601 intervals or consistent textual period description."
      }
    },
    {
      "name": "hasLegalStatusValue",
      "description": "Records the specific legal status (e.g., citizen, married, single, resident alien) assigned to an individual for each LegalStatusHistory instance.",
      "domain": [
        "LegalStatusHistory"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use well-defined, controlled terms for legal status.",
        "constraints": "One value per LegalStatusHistory record."
      }
    },
    {
      "name": "statusPeriod",
      "description": "Records the date or period during which a legal status was valid for a person.",
      "domain": [
        "LegalStatusHistory"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use a clear date range or ISO 8601 period representation.",
        "constraints": "One period per LegalStatusHistory."
      }
    },
    {
      "name": "hasIdentifierValue",
      "description": "States the value of an official identifier within an IdentifierHistory instance.",
      "domain": [
        "IdentifierHistory"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record identifier such as number, code, or string.",
        "constraints": "One value per IdentifierHistory record."
      }
    },
    {
      "name": "identifierType",
      "description": "Indicates the type of identifier (e.g., passport, national ID) in an IdentifierHistory record.",
      "domain": [
        "IdentifierHistory"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use standardized identifier type values.",
        "constraints": "One type per IdentifierHistory record."
      }
    },
    {
      "name": "identifierPeriod",
      "description": "Specifies the time period during which a given identifier was valid.",
      "domain": [
        "IdentifierHistory"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "State the active period for the identifier as a date range.",
        "constraints": "Single period per IdentifierHistory instance."
      }
    },
    {
      "name": "hasSequenceOrder",
      "description": "Specifies the position or ordering index of an EducationEpisode or Institution within an EducationalSequence, enabling chronological or custom ordering.",
      "domain": [
        "EducationEpisode",
        "Institution"
      ],
      "range": "xsd:integer",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use this data property to assign a unique, consecutive order (e.g., 1, 2, 3, ...) to each episode or institution in an EducationalSequence.",
        "constraints": "Each item in a sequence should have exactly one sequence order value; lower numbers represent earlier events. Sequence order must be unique within a given sequence."
      }
    },
    {
      "name": "performedOnDate",
      "description": "Specifies the date and time when a curation action took place.",
      "domain": [
        "CurationAction"
      ],
      "range": "xsd:dateTime",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record the timestamp of each specific curation, authorship, or modification action.",
        "constraints": "Exactly one value per curation action."
      }
    },
    {
      "name": "structuredAcrossGenerations",
      "description": "Specifies the generational scope or patterning of a relationship (familial or non-familial), indicating how it is structured or propagated across multiple generations.",
      "domain": [
        "FamilyRelationship",
        "SocialRelationship"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to qualify or annotate a relationship with its generational context or patterning (e.g., intergenerational mentorship, multi-generational family ties).",
        "constraints": "Describe as text or controlled vocabulary; only one value per relationship instance."
      }
    },
    {
      "name": "hasParticipationPeriod",
      "description": "Indicates the date or period during which a GroupParticipation episode was active for a person.",
      "domain": [
        "GroupParticipation"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record as an ISO 8601 date interval or a precise narrative period; captures the start and end of a group participation.",
        "constraints": "One period per participation instance; should be as precise as documentation allows."
      }
    },
    {
      "name": "translationLanguage",
      "description": "Indicates the language in which a particular NarrativeTranslation is available.",
      "domain": [
        "NarrativeTranslation"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use ISO language codes or controlled vocabulary for language specification.",
        "constraints": "One language per NarrativeTranslation instance."
      }
    },
    {
      "name": "translationCulturalFramework",
      "description": "Specifies the cultural framework or context applicable to a NarrativeTranslation, if adaptation goes beyond linguistic translation.",
      "domain": [
        "NarrativeTranslation"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Describe the cultural adaptation, if any, that is represented in a translation (e.g., through re-interpretation, contextualization).",
        "constraints": "Only use when the translation represents a distinctive cultural adaptation."
      }
    },
    {
      "name": "chronologicalResidenceOrder",
      "description": "The numeric or sequential order of a person's residences or locations over their lifetime, used to reconstruct the sequence of where a person has lived.",
      "domain": [
        "Location"
      ],
      "range": "xsd:integer",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Assign an explicit sequence or order number to each residence or location associated with a Person to trace life trajectory chronologically.",
        "constraints": "Unique per person and timeline; lower numbers represent earlier residences. Should be used in conjunction with properties linking Person and Location."
      }
    },
    {
      "name": "hasAnnotationDate",
      "description": "Specifies the date (or date-time) when a particular annotation or commentary was made or assigned to a life event or period.",
      "domain": [
        "Annotation"
      ],
      "range": "xsd:dateTime",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record the timestamp or date when an annotation or code was created/applied, supporting audit trails and analytical sequencing.",
        "constraints": "Should be included wherever annotation provenance is relevant; only one annotation date per annotation instance."
      }
    },
    {
      "name": "hasProficiencyLevel",
      "description": "Denotes the level or degree of proficiency a person has in a specific language, such as native, fluent, conversational, or basic.",
      "domain": [
        "LanguageProficiency"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use standardized proficiency levels or controlled vocabulary where possible.",
        "constraints": "One proficiency level per LanguageProficiency instance; use recognized frameworks if available (e.g., CEFR, ACTFL)."
      }
    },
    {
      "name": "hasLanguageContext",
      "description": "Adds contextual information about how or why a person uses or knows a language—such as familial, cultural, educational, or community background.",
      "domain": [
        "LanguageProficiency"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record cultural, familial, or situational context of language use/proficiency.",
        "constraints": "Use concise explanations; one context per LanguageProficiency instance, as relevant."
      }
    },
    {
      "name": "affiliationPeriod",
      "description": "Specifies the period during which a ReligiousAffiliation or LanguageUseContext was held or relevant to a person.",
      "domain": [
        "ReligiousAffiliation",
        "LanguageUseContext"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use ISO 8601 intervals or clear narrative periods to indicate the timespan of an affiliation or language use context.",
        "constraints": "One period per instance; necessary for histories with multiple changing affiliations or contexts."
      }
    },
    {
      "name": "hasReligion",
      "description": "Indicates the religion or spiritual tradition associated with a ReligiousAffiliation.",
      "domain": [
        "ReligiousAffiliation"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Enter the recognized name of the religion, denomination, or spiritual tradition.",
        "constraints": "Use a controlled list of religion names or codes when possible; one value per ReligiousAffiliation."
      }
    },
    {
      "name": "contextType",
      "description": "Specifies the type or nature of a LanguageUseContext (e.g., home, work, education, migration).",
      "domain": [
        "LanguageUseContext"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use controlled vocabulary or concise terms describing the domain of language use.",
        "constraints": "Each LanguageUseContext instance should have exactly one context type."
      }
    },
    {
      "name": "segmentLabel",
      "description": "A label or descriptor for a specific segment of an individual's life history data, such as childhood, early career, or migration period.",
      "domain": [
        "LifePhase"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use to assign a human-readable or analytical label to each segment/life phase when distinguishing privacy or access restrictions.",
        "constraints": "One label per LifePhase; choose meaningful, short descriptors."
      }
    },
    {
      "name": "aliasPeriod",
      "description": "Indicates the date or period during which a specific Alias was in use by an individual.",
      "domain": [
        "Alias"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Document the time frame in which an alias was used, using ISO 8601 intervals or narrative period descriptions.",
        "constraints": "One period per alias instance. Leave blank if duration is unknown."
      }
    },
    {
      "name": "preferredNamePeriod",
      "description": "Indicates the date or period during which a specific PreferredName was actively used by an individual.",
      "domain": [
        "PreferredName"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record the relevant period for preferred name usage, using ISO format or clear text. Supports histories where an individual's preferred name changed over time.",
        "constraints": "One period per PreferredName instance; period may overlap with legal/alias names."
      }
    },
    {
      "name": "contextOfNameUse",
      "description": "Describes the context in which a particular PreferredName or Alias is/was used, such as professional, community, or digital environment.",
      "domain": [
        "PreferredName",
        "Alias"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Specify the principal context (e.g., workplace, academic, online) where the name is/was relevant. Useful for distinguishing when different names are used in distinct spheres.",
        "constraints": "Use concise terms; one context per name instance. May be omitted if unambiguous."
      }
    },
    {
      "name": "hasArtifactType",
      "description": "Specifies the type of multimedia artifact (e.g., photograph, video, audio) being referenced.",
      "domain": [
        "MultimediaArtifact"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use controlled vocabulary terms such as 'photograph', 'video', or 'audio' to categorize multimedia artifacts by media type.",
        "constraints": "One type per artifact instance; refer to a recognized list of media types when possible."
      }
    },
    {
      "name": "hasInstitutionCountry",
      "description": "Indicates the country in which an educational institution conferring a degree, certification, diploma, or license is located.",
      "domain": [
        "Institution"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Specify the country as a controlled value (such as ISO country code or full country name).",
        "constraints": "Each institution instance should have one associated country; use recognized country codes or names."
      }
    },
    {
      "name": "hasLicenseNumber",
      "description": "Records the identifier, number, or code assigned to a license granted to an individual.",
      "domain": [
        "License"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record the exact license number or identifier as it appears on the official document.",
        "constraints": "One value per license instance; sensitive and may require privacy protection."
      }
    },
    {
      "name": "licenseType",
      "description": "Specifies the type or category of the license (e.g., driver's license, teaching license, professional certification).",
      "domain": [
        "License"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Define the nature or class of the license using a standard controlled vocabulary.",
        "constraints": "One type per license instance; controlled terms preferred."
      }
    },
    {
      "name": "licensePeriod",
      "description": "Indicates the date or period during which a particular license was valid for an individual.",
      "domain": [
        "License"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record the period of validity for the license using ISO 8601 intervals or a clear text date range.",
        "constraints": "One period per license; duration should reflect actual validity dates whenever possible."
      }
    },
    {
      "name": "achievementContext",
      "description": "Describes the context, circumstance, or environment in which an informal achievement or recognition was accomplished or recorded.",
      "domain": [
        "InformalAchievement"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Record a concise contextual description specifying how or why the achievement occurred (e.g., 'community service', 'peer recognition', 'informal innovation').",
        "constraints": "One context per informal achievement; use controlled terms where appropriate."
      }
    },
    {
      "name": "recognitionContext",
      "description": "Specifies the context or situation in which a formal award or recognition was conferred, such as the specific event, competition, or institutional framework.",
      "domain": [
        "Award"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Capture the awarding context (e.g., name of competition, annual meeting, research grant) for traceability and provenance.",
        "constraints": "Record exactly one context per award; use controlled vocabulary or descriptive text."
      }
    },
    {
      "name": "hasMembershipPeriod",
      "description": "Specifies the temporal period during which a group or network membership was valid or active for a given person.",
      "domain": [
        "GroupMembership"
      ],
      "range": "xsd:string",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Indicate start and end dates, or relevant period, for each GroupMembership instance (ISO 8601 format or equivalent).",
        "constraints": "Each GroupMembership instance should have one period; leave blank if unknown."
      }
    },
    {
      "name": "birthDate",
      "description": "Specifies the date on which a person was born.",
      "domain": [
        "Person"
      ],
      "range": "xsd:date",
      "characteristics": [
        "functional"
      ],
      "usage_guideline": {
        "description": "Use this property to record the specific birth date of a person where available.",
        "constraints": "One value per person; use ISO 8601 date format (YYYY-MM-DD) for consistency."
      }
    }
  ]
}